#ifndef __CONSTANTS_OUTPUTS__
#define __CONSTANTS_OUTPUTS__

#define EKRAN_LIST_OUTPUTS_FOR_RANGUVANNJA        (EKRAN_LIST_INPUTS_FOR_RANGUVANNJA + 1)

#define EKRAN_RANGUVANNJA_OUTPUT_1                (EKRAN_RANGUVANNJA_INPUT_LAST + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_2                (EKRAN_RANGUVANNJA_OUTPUT_1 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_3                (EKRAN_RANGUVANNJA_OUTPUT_2 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_4                (EKRAN_RANGUVANNJA_OUTPUT_3 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_5                (EKRAN_RANGUVANNJA_OUTPUT_4 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_6                (EKRAN_RANGUVANNJA_OUTPUT_5 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_7                (EKRAN_RANGUVANNJA_OUTPUT_6 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_8                (EKRAN_RANGUVANNJA_OUTPUT_7 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_9                (EKRAN_RANGUVANNJA_OUTPUT_8 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_10               (EKRAN_RANGUVANNJA_OUTPUT_9 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_11               (EKRAN_RANGUVANNJA_OUTPUT_10 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_12               (EKRAN_RANGUVANNJA_OUTPUT_11 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_13               (EKRAN_RANGUVANNJA_OUTPUT_12 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_14               (EKRAN_RANGUVANNJA_OUTPUT_13 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_15               (EKRAN_RANGUVANNJA_OUTPUT_14 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_16               (EKRAN_RANGUVANNJA_OUTPUT_15 + 1)

#define EKRAN_RANGUVANNJA_OUTPUT_LAST             EKRAN_RANGUVANNJA_OUTPUT_16

#define MAX_ROW_LIST_OUTPUTS_FOR_RANGUVANNJA       NUMBER_SIMPLE_OUTPUTS
#define MAX_ROW_RANGUVANNJA_OUTPUT                 TOTAL_SIGNAL_FOR_RNG_BIG

#define NAME_RANG_RU    \
  "  Блок.вкл.ВВ   ",   \
  " Сброс индикации",   \
  "   Сброс реле   ",   \
  " Местн./Дистанц.",   \
  "  Положение ВВ  ",   \
  "Откл.от вн.защит",   \
  "     Вкл.ВВ     ",   \
  " Контроль Вкл.  ",   \
  "    Откл.ВВ     ",   \
  " Контроль Откл. ",   \
  "   Привод ВВ    ",   \
  " Прев.Iот.ном.  ",   \
  " Крит.Ресурс ВВ ",   \
  " Исч.Ресурс ВВ  ",   \
  "  Неиспр.Общая  ",   \
  "  Неиспр.Авар.  ",   \
  " Работа Ан.Рег. ",   \
  " Работа Д.Рег.  ",   \
  " Откл.от защит  ",   \
  "       БО       ",   \
  "       БВ       ",   \
  "     1Ф КЗ      ",   \
  "     2Ф КЗ      ",   \
  "     3Ф КЗ      ",   \
  " 1-я гр.уставок ",   \
  " 2-я гр.уставок ",   \
  " 3-я гр.уставок ",   \
  " 4-я гр.уставок ",   \
  " Инв.ДВ гр.уст. ",   \
  "Блк.гр.уст.от з.",   \
  " С.блк.Гот.к ТУ ",   \
  " Готовность к ТУ",   \
  "  Изм.настроек  ",   \
  "    Блок.ДЗ1    ",   \
  "     ПО ДЗ1     ",   \
  "      ДЗ1       ",   \
  "  ПО АМТЗ ДЗ1   ",   \
  "    АМТЗ ДЗ1    ",   \
  "    Блок.ДЗ2    ",   \
  "  Блок.уск.ДЗ2  ",   \
  "   Оп.уск.ДЗ2   ",   \
  "  Сект.ДЗ2 Пр.  ",   \
  " Сект.ДЗ2 Обр.  ",   \
  "   ПО ДЗ2 Пр.   ",   \
  "  ПО ДЗ2 Обр.   ",   \
  "      ДЗ2       ",   \
  "  ПО АМТЗ ДЗ2   ",   \
  "    АМТЗ ДЗ2    ",   \
  "    Блок.ДЗ3    ",   \
  "  Блок.уск.ДЗ3  ",   \
  "   Оп.уск.ДЗ3   ",   \
  "  Сект.ДЗ3 Пр.  ",   \
  " Сект.ДЗ3 Обр.  ",   \
  "   ПО ДЗ3 Пр.   ",   \
  "  ПО ДЗ3 Обр.   ",   \
  "      ДЗ3       ",   \
  "  ПО АМТЗ ДЗ3   ",   \
  "    АМТЗ ДЗ3    ",   \
  "    Блок.ДЗ4    ",   \
  "  Блок.уск.ДЗ4  ",   \
  "   Оп.уск.ДЗ4   ",   \
  "  Сект.ДЗ4 Пр.  ",   \
  " Сект.ДЗ4 Обр.  ",   \
  "   ПО ДЗ4 Пр.   ",   \
  "  ПО ДЗ4 Обр.   ",   \
  "      ДЗ4       ",   \
  "  ПО АМТЗ ДЗ4   ",   \
  "    АМТЗ ДЗ4    ",   \
  "   Вн.НЦН ДЗ    ",   \
  "     НЦН ДЗ     ",   \
  "    ПО U ДЗ     ",   \
  "  ПО I Блк.ДЗ   ",   \
  "3Ф ДЗ (Пр./Обр.)",   \
  "    СНЦН ДЗ     ",   \
  "   Блок.МТЗ1    ",   \
  "   Блок.МТЗ2    ",   \
  " Блок.уск.МТЗ2  ",   \
  "   Блок.МТЗ3    ",   \
  "   Блок.МТЗ4    ",   \
  " Сект.МТЗН1 Пр. ",   \
  " Сект.МТЗН1 Обр.",   \
  "    ПО МТЗ1     ",   \
  " ПО МТЗН1 Прямой",   \
  " ПО МТЗН1 Обр.  ",   \
  "  ПО U МТЗПН1   ",   \
  "   ПО МТЗПН1    ",   \
  "      МТЗ1      ",   \
  " Сект.МТЗН2 Пр. ",   \
  " Сект.МТЗН2 Обр.",   \
  "    ПО МТЗ2     ",   \
  " ПО МТЗН2 Прямой",   \
  " ПО МТЗН2 Обр.  ",   \
  "  ПО U МТЗПН2   ",   \
  "   ПО МТЗПН2    ",   \
  "      МТЗ2      ",   \
  " Сект.МТЗН3 Пр. ",   \
  " Сект.МТЗН3 Обр.",   \
  "    ПО МТЗ3     ",   \
  " ПО МТЗН3 Прямой",   \
  " ПО МТЗН3 Обр.  ",   \
  "  ПО U МТЗПН3   ",   \
  "   ПО МТЗПН3    ",   \
  "      МТЗ3      ",   \
  " Сект.МТЗН4 Пр. ",   \
  " Сект.МТЗН4 Обр.",   \
  "    ПО МТЗ4     ",   \
  " ПО МТЗН4 Прямой",   \
  " ПО МТЗН4 Обр.  ",   \
  "  ПО U МТЗПН4   ",   \
  "   ПО МТЗПН4    ",   \
  "      МТЗ4      ",   \
  " ПО блок.U МТЗН ",   \
  "    НЦН-МТЗ     ",   \
  "    Блок.ЗДЗ    ",   \
  " Пуск ЗДЗ от ДВ ",   \
  " Свет ЗДЗ от ДВ ",   \
  "Свет ЗДЗ от ОВД1",   \
  "Свет ЗДЗ от ОВД2",   \
  "Свет ЗДЗ от ОВД3",   \
  "     ПО ЗДЗ     ",   \
  "      ЗДЗ       ",   \
  "    Блок.НЗЗ    ",   \
  "     ПО НЗЗ     ",   \
  "      НЗЗ       ",   \
  "   ПО ЗЗ(3I0)   ",   \
  "    ЗЗ(3I0)     ",   \
  "   ПО ЗЗ(3U0)   ",   \
  "    ЗЗ(3U0)     ",   \
  "   Сектор НЗЗ   ",   \
  "   Блок.ТЗНП1   ",   \
  " Сект.ТЗНП1 Пр. ",   \
  " Сект.ТЗНП1 Обр.",   \
  "ПО 3I0 ТЗНП1 Пр.",   \
  "ПО 3I0 ТЗНП1 Обр",   \
  "ПО 3U0 ТЗНП1 Пр.",   \
  "ПО 3U0 ТЗНП1 Обр",   \
  "  ПО ТЗНП1 Пр.  ",   \
  " ПО ТЗНП1 Обр.  ",   \
  "     ТЗНП1      ",   \
  "   Блок.ТЗНП2   ",   \
  " Сект.ТЗНП2 Пр. ",   \
  " Сект.ТЗНП2 Обр.",   \
  "ПО 3I0 ТЗНП2 Пр.",   \
  "ПО 3I0 ТЗНП2 Обр",   \
  "ПО 3U0 ТЗНП2 Пр.",   \
  "ПО 3U0 ТЗНП2 Обр",   \
  "  ПО ТЗНП2 Пр.  ",   \
  " ПО ТЗНП2 Обр.  ",   \
  "     ТЗНП2      ",   \
  "   Блок.ТЗНП3   ",   \
  " Сект.ТЗНП3 Пр. ",   \
  " Сект.ТЗНП3 Обр.",   \
  "ПО 3I0 ТЗНП3 Пр.",   \
  "ПО 3I0 ТЗНП3 Обр",   \
  "ПО 3U0 ТЗНП3 Пр.",   \
  "ПО 3U0 ТЗНП3 Обр",   \
  "  ПО ТЗНП3 Пр.  ",   \
  " ПО ТЗНП3 Обр.  ",   \
  "     ТЗНП3      ",   \
  " Стат.блок.АПВ  ",   \
  "      АПВ       ",   \
  "      АПВ2      ",   \
  "      АПВ3      ",   \
  "      АПВ4      ",   \
  "   Работа АПВ   ",   \
  " АЧР/ЧАПВ от ДВ ",   \
  "   Блок.АЧР1    ",   \
  "   Блок.АЧР2    ",   \
  "   Разр.ЧАПВ    ",   \
  "   Блок.ЧАПВ    ",   \
  "    ПО АЧР1     ",   \
  "    ПО ЧАПВ1    ",   \
  "   АЧР/ЧАПВ1    ",   \
  "    ПО АЧР2     ",   \
  "    ПО ЧАПВ2    ",   \
  "   АЧР/ЧАПВ2    ",   \
  " Пуск УРОВ от ДВ",   \
  "    ПО УРОВ     ",   \
  "     УРОВ1      ",   \
  "     УРОВ2      ",   \
  " Блок.ЗОП(КОФ)  ",   \
  "  ПО ЗОП(КОФ)   ",   \
  "    ЗОП(КОФ)    ",   \
  "  Блок.ЗНмин1   ",   \
  "  Пуск ЗНмин1   ",   \
  "  Блок.ЗНмин2   ",   \
  "  Пуск ЗНмин2   ",   \
  "   ПО ЗНмин1    ",   \
  " ПО Uблк.ЗНмин1 ",   \
  " ПО Iблк.ЗНмин1 ",   \
  "     ЗНмин1     ",   \
  "     ПО ЗНмин2  ",   \
  " ПО Uблк.ЗНмин2 ",   \
  " ПО Iблк.ЗНмин2 ",   \
  "     ЗНмин2     ",   \
  "  Блок.ЗНмакс1  ",   \
  "   ПО ЗНмакс1   ",   \
  "    ЗНмакс1     ",   \
  "  Блок.ЗНмакс2  ",   \
  "   ПО ЗНмакс2   ",   \
  "    ЗНмакс2     ",   \
  "    Блок.УЗx    ",   \
  "     ПО УЗx     ",   \
  "      УЗx       ",   \
  " Вх.О-функции1  ",   \
  " Вых.О-функции1 ",   \
  " Вх.О-функции2  ",   \
  " Вых.О-функции2 ",   \
  " Вх.О-функции3  ",   \
  " Вых.О-функции3 ",   \
  " Вх.О-функции4  ",   \
  " Вых.О-функции4 ",   \
  " Вх.О-функции5  ",   \
  " Вых.О-функции5 ",   \
  " Вх.О-функции6  ",   \
  " Вых.О-функции6 ",   \
  " Вх.О-функции7  ",   \
  " Вых.О-функции7 ",   \
  " Вх.О-функции8  ",   \
  " Вых.О-функции8 ",   \
  " Вх.О-функции9  ",   \
  " Вых.О-функции9 ",   \
  " Вх.О-функции10 ",   \
  " Вых.О-функции10",   \
  " Вх.О-функции11 ",   \
  " Вых.О-функции11",   \
  " Вх.О-функции12 ",   \
  " Вых.О-функции12",   \
  " Вх.О-функции13 ",   \
  " Вых.О-функции13",   \
  " Вх.О-функции14 ",   \
  " Вых.О-функции14",   \
  " Вх.О-функции15 ",   \
  " Вых.О-функции15",   \
  " Вх.О-функции16 ",   \
  " Вых.О-функции16",   \
  " Уст.О-триггера1",   \
  " Сбр.О-триггера1",   \
  " Вых.О-триггера1",   \
  " Уст.О-триггера2",   \
  " Сбр.О-триггера2",   \
  " Вых.О-триггера2",   \
  " Уст.О-триггера3",   \
  " Сбр.О-триггера3",   \
  " Вых.О-триггера3",   \
  " Уст.О-триггера4",   \
  " Сбр.О-триггера4",   \
  " Вых.О-триггера4",   \
  "      О-И1      ",   \
  "      О-И2      ",   \
  "      О-И3      ",   \
  "      О-И4      ",   \
  "      О-И5      ",   \
  "      О-И6      ",   \
  "      О-И7      ",   \
  "      О-И8      ",   \
  "     О-ИЛИ1     ",   \
  "     О-ИЛИ2     ",   \
  "     О-ИЛИ3     ",   \
  "     О-ИЛИ4     ",   \
  "     О-ИЛИ5     ",   \
  "     О-ИЛИ6     ",   \
  "     О-ИЛИ7     ",   \
  "     О-ИЛИ8     ",   \
  "  О-Искл.ИЛИ1   ",   \
  "  О-Искл.ИЛИ2   ",   \
  "  О-Искл.ИЛИ3   ",   \
  "  О-Искл.ИЛИ4   ",   \
  "  О-Искл.ИЛИ5   ",   \
  "  О-Искл.ИЛИ6   ",   \
  "  О-Искл.ИЛИ7   ",   \
  "  О-Искл.ИЛИ8   ",   \
  "     О-НЕ1      ",   \
  "     О-НЕ2      ",   \
  "     О-НЕ3      ",   \
  "     О-НЕ4      ",   \
  "     О-НЕ5      ",   \
  "     О-НЕ6      ",   \
  "     О-НЕ7      ",   \
  "     О-НЕ8      ",   \
  "     О-НЕ9      ",   \
  "     О-НЕ10     ",   \
  "     О-НЕ11     ",   \
  "     О-НЕ12     ",   \
  "     О-НЕ13     ",   \
  "     О-НЕ14     ",   \
  "     О-НЕ15     ",   \
  "     О-НЕ16     ",   \
  "      ФС1       ",   \
  "      ФС2       ",   \
  "      ФС3       ",   \
  "      ФС4       ",   \
  "      ФС5       ",   \
  "      ФС6       ",   \
  "      ФС7       ",   \
  "      ФС8       ",   \
  "      ФС9       ",   \
  "      ФС10      ",   \
  "      ФС11      ",   \
  "      ФС12      ",   \
  "      ФС13      ",   \
  "      ФС14      ",   \
  "      ФС15      ",   \
  "      ФС16      ",   \
  " Ош.настр.р.лог."

#define NAME_RANG_UA    \
  " Блок.увімкн.ВВ ",   \
  " Скид.індикації ",   \
  "   Скид.реле    ",   \
  " Місц./Дистанц. ",   \
  "    Стан ВВ     ",   \
  "Вимк.від зовн.з.",   \
  "    Увімк.ВВ    ",   \
  " Контроль Увімк.",   \
  "    Вимк.ВВ     ",   \
  " Контроль Вимк. ",   \
  "   Привід ВВ    ",   \
  " Перев.Iв.ном.  ",   \
  " Крит.Ресурс ВВ ",   \
  " Вич.Ресурс ВВ  ",   \
  " Неспр.Загальна ",   \
  "  Неспр.Авар.   ",   \
  " Роб.Ан.Реєстр. ",   \
  " Роб.Д.Реєстр.  ",   \
  " Вимк.від зах.  ",   \
  "     БВимк.     ",   \
  "    БУвімк.     ",   \
  "     1Ф КЗ      ",   \
  "     2Ф КЗ      ",   \
  "     3Ф КЗ      ",   \
  " 1-а гр.уставок ",   \
  " 2-а гр.уставок ",   \
  " 3-а гр.уставок ",   \
  " 4-а гр.уставок ",   \
  " Інв.ДВ гр.уст. ",   \
  "Бл.гр.уст.від з.",   \
  " С.блк.Гот.до ТУ",   \
  "Готовність до ТУ",   \
  " Зм.налаштування",   \
  "    Блок.ДЗ1    ",   \
  "     ПО ДЗ1     ",   \
  "      ДЗ1       ",   \
  "  ПО АМСЗ ДЗ1   ",   \
  "    АМСЗ ДЗ1    ",   \
  "    Блок.ДЗ2    ",   \
  "  Блок.пр.ДЗ2   ",   \
  "   Оп.пр.ДЗ2    ",   \
  "  Сект.ДЗ2 Пр.  ",   \
  "  Сект.ДЗ2 Зв.  ",   \
  "   ПО ДЗ2 Пр.   ",   \
  "   ПО ДЗ2 Зв.   ",   \
  "      ДЗ2       ",   \
  "  ПО АМСЗ ДЗ2   ",   \
  "    АМСЗ ДЗ2    ",   \
  "    Блок.ДЗ3    ",   \
  "  Блок.пр.ДЗ3   ",   \
  "   Оп.пр.ДЗ3    ",   \
  "  Сект.ДЗ3 Пр.  ",   \
  "  Сект.ДЗ3 Зв.  ",   \
  "   ПО ДЗ3 Пр.   ",   \
  "   ПО ДЗ3 Зв.   ",   \
  "      ДЗ3       ",   \
  "  ПО АМСЗ ДЗ3   ",   \
  "    АМСЗ ДЗ3    ",   \
  "    Блок.ДЗ4    ",   \
  "  Блок.пр.ДЗ4   ",   \
  "   Оп.пр.ДЗ4    ",   \
  "  Сект.ДЗ4 Пр.  ",   \
  "  Сект.ДЗ4 Зв.  ",   \
  "   ПО ДЗ4 Пр.   ",   \
  "   ПО ДЗ4 Зв.   ",   \
  "      ДЗ4       ",   \
  "  ПО АМСЗ ДЗ4   ",   \
  "    АМСЗ ДЗ4    ",   \
  "  Зовн.НКН ДЗ   ",   \
  "     НКН ДЗ     ",   \
  "    ПО U ДЗ     ",   \
  "  ПО I Блк.ДЗ   ",   \
  " 3Ф ДЗ (Пр./Зв.)",   \
  "    СНКН ДЗ     ",   \
  "   Блок.МСЗ1    ",   \
  "   Блок.МСЗ2    ",   \
  " Блок.приск.МСЗ2",   \
  "   Блок.МСЗ3    ",   \
  "   Блок.МСЗ4    ",   \
  " Сект.МСЗС1 Пр. ",   \
  " Сект.МСЗС1 Зв. ",   \
  "    ПО МСЗ1     ",   \
  "  ПО МСЗС1 Пр.  ",   \
  "  ПО МСЗС1 Зв.  ",   \
  "  ПО U МСЗПН1   ",   \
  "   ПО МСЗПН1    ",   \
  "      МСЗ1      ",   \
  " Сект.МСЗС2 Пр. ",   \
  " Сект.МСЗС2 Зв. ",   \
  "    ПО МСЗ2     ",   \
  "  ПО МСЗС2 Пр.  ",   \
  "  ПО МСЗС2 Зв.  ",   \
  "  ПО U МСЗПН2   ",   \
  "   ПО МСЗПН2    ",   \
  "      МСЗ2      ",   \
  " Сект.МСЗС3 Пр. ",   \
  " Сект.МСЗС3 Зв. ",   \
  "    ПО МСЗ3     ",   \
  "  ПО МСЗС3 Пр.  ",   \
  "  ПО МСЗС3 Зв.  ",   \
  "  ПО U МСЗПН3   ",   \
  "   ПО МСЗПН3    ",   \
  "      МСЗ3      ",   \
  " Сект.МСЗС4 Пр. ",   \
  " Сект.МСЗС4 Зв. ",   \
  "    ПО МСЗ4     ",   \
  "  ПО МСЗС4 Пр.  ",   \
  "  ПО МСЗС4 Зв.  ",   \
  "  ПО U МСЗПН4   ",   \
  "   ПО МСЗПН4    ",   \
  "      МСЗ4      ",   \
  " ПО блок.U МСЗС ",   \
  "    НКН-МСЗ     ",   \
  "    Блок.ЗДЗ    ",   \
  " Пуск ЗДЗ від ДВ",   \
  " Св.ЗДЗ від ДВ  ",   \
  " Св.ЗДЗ від ОВД1",   \
  " Св.ЗДЗ від ОВД2",   \
  " Св.ЗДЗ від ОВД3",   \
  "     ПО ЗДЗ     ",   \
  "      ЗДЗ       ",   \
  "    Блок.НЗЗ    ",   \
  "     ПО НЗЗ     ",   \
  "      НЗЗ       ",   \
  "   ПО ЗЗ(3I0)   ",   \
  "    ЗЗ(3I0)     ",   \
  "   ПО ЗЗ(3U0)   ",   \
  "    ЗЗ(3U0)     ",   \
  "   Сектор НЗЗ   ",   \
  "   Блок.СЗНП1   ",   \
  " Сект.СЗНП1 Пр. ",   \
  " Сект.СЗНП1 Зв. ",   \
  "ПО 3I0 СЗНП1 Пр.",   \
  "ПО 3I0 СЗНП1 Зв.",   \
  "ПО 3U0 СЗНП1 Пр.",   \
  "ПО 3U0 СЗНП1 Зв.",   \
  "  ПО СЗНП1 Пр.  ",   \
  "  ПО СЗНП1 Зв.  ",   \
  "     СЗНП1      ",   \
  "   Блок.СЗНП2   ",   \
  " Сект.СЗНП2 Пр. ",   \
  " Сект.СЗНП2 Зв. ",   \
  "ПО 3I0 СЗНП2 Пр.",   \
  "ПО 3I0 СЗНП2 Зв.",   \
  "ПО 3U0 СЗНП2 Пр.",   \
  "ПО 3U0 СЗНП2 Зв.",   \
  "  ПО СЗНП2 Пр.  ",   \
  "  ПО СЗНП2 Зв.  ",   \
  "     СЗНП2      ",   \
  "   Блок.СЗНП3   ",   \
  " Сект.СЗНП3 Пр. ",   \
  " Сект.СЗНП3 Зв. ",   \
  "ПО 3I0 СЗНП3 Пр.",   \
  "ПО 3I0 СЗНП3 Зв.",   \
  "ПО 3U0 СЗНП3 Пр.",   \
  "ПО 3U0 СЗНП3 Зв.",   \
  "  ПО СЗНП3 Пр.  ",   \
  "  ПО СЗНП3 Зв.  ",   \
  "     СЗНП3      ",   \
  " Стат.блок.АПВ  ",   \
  "      АПВ       ",   \
  "      АПВ2      ",   \
  "      АПВ3      ",   \
  "      АПВ4      ",   \
  "   Робота АПВ   ",   \
  " АЧР/ЧАПВ від ДВ",   \
  "   Блок.АЧР1    ",   \
  "   Блок.АЧР2    ",   \
  "  Дозвіл ЧАПВ   ",   \
  "   Блок.ЧАПВ    ",   \
  "    ПО АЧР1     ",   \
  "    ПО ЧАПВ1    ",   \
  "   АЧР/ЧАПВ1    ",   \
  "    ПО АЧР2     ",   \
  "    ПО ЧАПВ2    ",   \
  "   АЧР/ЧАПВ2    ",   \
  "Пуск ПРВВ від ДВ",   \
  "    ПО ПРВВ     ",   \
  "     ПРВВ1      ",   \
  "     ПРВВ2      ",   \
  " Блок.ЗЗП(КОФ)  ",   \
  "  ПО ЗЗП(КОФ)   ",   \
  "    ЗЗП(КОФ)    ",   \
  "  Блок.ЗНмін1   ",   \
  "  Пуск ЗНмін1   ",   \
  "  Блок.ЗНмін2   ",   \
  "  Пуск ЗНмін2   ",   \
  "   ПО ЗНмін1    ",   \
  " ПО Uблк.ЗНмін1 ",   \
  " ПО Iблк.ЗНмін1 ",   \
  "     ЗНмін1     ",   \
  "     ПО ЗНмін2  ",   \
  " ПО Uблк.ЗНмін2 ",   \
  " ПО Iблк.ЗНмін2 ",   \
  "     ЗНмін2     ",   \
  "  Блок.ЗНмакс1  ",   \
  "   ПО ЗНмакс1   ",   \
  "    ЗНмакс1     ",   \
  "  Блок.ЗНмакс2  ",   \
  "   ПО ЗНмакс2   ",   \
  "    ЗНмакс2     ",   \
  "    Блок.УЗx    ",   \
  "     ПО УЗx     ",   \
  "      УЗx       ",   \
  " Вх.В-функції1  ",   \
  " Вих.В-функції1 ",   \
  " Вх.В-функції2  ",   \
  " Вих.В-функції2 ",   \
  " Вх.В-функції3  ",   \
  " Вих.В-функції3 ",   \
  " Вх.В-функції4  ",   \
  " Вих.В-функції4 ",   \
  " Вх.В-функції5  ",   \
  " Вих.В-функції5 ",   \
  " Вх.В-функції6  ",   \
  " Вих.В-функції6 ",   \
  " Вх.В-функції7  ",   \
  " Вих.В-функції7 ",   \
  " Вх.В-функції8  ",   \
  " Вих.В-функції8 ",   \
  " Вх.В-функції9  ",   \
  " Вих.В-функції9 ",   \
  " Вх.В-функції10 ",   \
  " Вих.В-функції10",   \
  " Вх.В-функції11 ",   \
  " Вих.В-функції11",   \
  " Вх.В-функції12 ",   \
  " Вих.В-функції12",   \
  " Вх.В-функції13 ",   \
  " Вих.В-функції13",   \
  " Вх.В-функції14 ",   \
  " Вих.В-функції14",   \
  " Вх.В-функції15 ",   \
  " Вих.В-функції15",   \
  " Вх.В-функції16 ",   \
  " Вих.В-функції16",   \
  " Вст.В-триґера1 ",   \
  " Ск.В-триґера1  ",   \
  " Вих.В-триґера1 ",   \
  " Вст.В-триґера2 ",   \
  " Ск.В-триґера2  ",   \
  " Вих.В-триґера2 ",   \
  " Вст.В-триґера3 ",   \
  " Ск.В-триґера3  ",   \
  " Вих.В-триґера3 ",   \
  " Вст.В-триґера4 ",   \
  " Ск.В-триґера4  ",   \
  " Вих.В-триґера4 ",   \
  "      В-І1      ",   \
  "      В-І2      ",   \
  "      В-І3      ",   \
  "      В-І4      ",   \
  "      В-І5      ",   \
  "      В-І6      ",   \
  "      В-І7      ",   \
  "      В-І8      ",   \
  "     В-АБО1     ",   \
  "     В-АБО2     ",   \
  "     В-АБО3     ",   \
  "     В-АБО4     ",   \
  "     В-АБО5     ",   \
  "     В-АБО6     ",   \
  "     В-АБО7     ",   \
  "     В-АБО8     ",   \
  "  В-Викл.АБО1   ",   \
  "  В-Викл.АБО2   ",   \
  "  В-Викл.АБО3   ",   \
  "  В-Викл.АБО4   ",   \
  "  В-Викл.АБО5   ",   \
  "  В-Викл.АБО6   ",   \
  "  В-Викл.АБО7   ",   \
  "  В-Викл.АБО8   ",   \
  "     В-НЕ1      ",   \
  "     В-НЕ2      ",   \
  "     В-НЕ3      ",   \
  "     В-НЕ4      ",   \
  "     В-НЕ5      ",   \
  "     В-НЕ6      ",   \
  "     В-НЕ7      ",   \
  "     В-НЕ8      ",   \
  "     В-НЕ9      ",   \
  "     В-НЕ10     ",   \
  "     В-НЕ11     ",   \
  "     В-НЕ12     ",   \
  "     В-НЕ13     ",   \
  "     В-НЕ14     ",   \
  "     В-НЕ15     ",   \
  "     В-НЕ16     ",   \
  "      ФЗ1       ",   \
  "      ФЗ2       ",   \
  "      ФЗ3       ",   \
  "      ФЗ4       ",   \
  "      ФЗ5       ",   \
  "      ФЗ6       ",   \
  "      ФЗ7       ",   \
  "      ФЗ8       ",   \
  "      ФЗ9       ",   \
  "      ФЗ10      ",   \
  "      ФЗ11      ",   \
  "      ФЗ12      ",   \
  "      ФЗ13      ",   \
  "      ФЗ14      ",   \
  "      ФЗ15      ",   \
  "      ФЗ16      ",   \
  " Пом.нал.р.лог. "
    
#define NAME_RANG_EN    \
  " ON CB Blocking ",   \
  "Indication Reset",   \
  "  Relay Reset   ",   \
  "  Local/Remote  ",   \
  "  State of CB   ",   \
  "Откл.от вн.защит",   \
  "     On CB      ",   \
  " On CB Control  ",   \
  "     Off CB     ",   \
  " Off CB Control ",   \
  "  CB Actuator   ",   \
  " Прев.Iот.ном.  ",   \
  " Крит.Ресурс ВВ ",   \
  " Исч.Ресурс ВВ  ",   \
  "  Total Fault   ",   \
  " Emergence Fault",   \
  "An.Rec.Operation",   \
  " D.Rec.Operation",   \
  " Откл.от защит  ",   \
  "Off CB Operation",   \
  " On CB Operation",   \
  "     1Ф КЗ      ",   \
  "     2Ф КЗ      ",   \
  "     3Ф КЗ      ",   \
  " Pick-up Set 1  ",   \
  " Pick-up Set 2  ",   \
  " Pick-up Set 3  ",   \
  " Pick-up Set 4  ",   \
  " Инв.ДВ гр.уст. ",   \
  "Блк.гр.уст.от з.",   \
  " С.блк.Гот.к ТУ ",   \
  " Готовность к ТУ",   \
  "Changed settings",   \
  "   Blc.of ДЗ1   ",   \
  "     ПО ДЗ1     ",   \
  "      ДЗ1       ",   \
  "  ПО АМТЗ ДЗ1   ",   \
  "    АМТЗ ДЗ1    ",   \
  "    Блок.ДЗ2    ",   \
  "  Блок.уск.ДЗ2  ",   \
  "   Оп.уск.ДЗ2   ",   \
  "  Сект.ДЗ2 Пр.  ",   \
  " Сект.ДЗ2 Обр.  ",   \
  "   ПО ДЗ2 Пр.   ",   \
  "  ПО ДЗ2 Обр.   ",   \
  "      ДЗ2       ",   \
  "  ПО АМТЗ ДЗ2   ",   \
  "    АМТЗ ДЗ2    ",   \
  "   Blc.of ДЗ3   ",   \
  "  ДЗ3 Acc.Blc.  ",   \
  "   Оп.уск.ДЗ3   ",   \
  "  Сект.ДЗ3 Пр.  ",   \
  " Сект.ДЗ3 Обр.  ",   \
  "   ПО ДЗ3 Пр.   ",   \
  "  ПО ДЗ3 Обр.   ",   \
  "      ДЗ3       ",   \
  "  ПО АМТЗ ДЗ3   ",   \
  "    АМТЗ ДЗ3    ",   \
  "   Blc.of ДЗ4   ",   \
  "  ДЗ4 Acc.Blc.  ",   \
  "   Оп.уск.ДЗ4   ",   \
  "  Сект.ДЗ4 Пр.  ",   \
  " Сект.ДЗ4 Обр.  ",   \
  "   ПО ДЗ4 Пр.   ",   \
  "  ПО ДЗ4 Обр.   ",   \
  "      ДЗ4       ",   \
  "  ПО АМТЗ ДЗ4   ",   \
  "    АМТЗ ДЗ4    ",   \
  "   Вн.НЦН ДЗ    ",   \
  "     НЦН ДЗ     ",   \
  "    ПО U ДЗ     ",   \
  "  ПО I Блк.ДЗ   ",   \
  "3Ф ДЗ (Пр./Обр.)",   \
  "    СНЦН ДЗ     ",   \
  "  Blc.of OCP1   ",   \
  "  Blc.of OCP2   ",   \
  "  OCP2 Acc.Blc. ",   \
  "  Blc.of OCP3   ",   \
  "  Blc.of OCP4   ",   \
  " Сект.МТЗН1 Пр. ",   \
  " Сект.МТЗН1 Обр.",   \
  "    OCP1 SE     ",   \
  " ПО МТЗН1 Прямой",   \
  " ПО МТЗН1 Обр.  ",   \
  "  ПО U МТЗПН1   ",   \
  "   ПО МТЗПН1    ",   \
  "      OCP1      ",   \
  " Сект.МТЗН2 Пр. ",   \
  " Сект.МТЗН2 Обр.",   \
  "    OCP2 SE     ",   \
  " ПО МТЗН2 Прямой",   \
  " ПО МТЗН2 Обр.  ",   \
  "  ПО U МТЗПН2   ",   \
  "   ПО МТЗПН2    ",   \
  "      OCP2      ",   \
  " Сект.МТЗН3 Пр. ",   \
  " Сект.МТЗН3 Обр.",   \
  "    OCP3 SE     ",   \
  " ПО МТЗН3 Прямой",   \
  " ПО МТЗН3 Обр.  ",   \
  "  ПО U МТЗПН3   ",   \
  "   ПО МТЗПН3    ",   \
  "      OCP3      ",   \
  " Сект.МТЗН4 Пр. ",   \
  " Сект.МТЗН4 Обр.",   \
  "    OCP4 SE     ",   \
  " ПО МТЗН4 Прямой",   \
  " ПО МТЗН4 Обр.  ",   \
  "  ПО U МТЗПН4   ",   \
  "   ПО МТЗПН4    ",   \
  "      OCP4      ",   \
  " ПО блок.U МТЗН ",   \
  "    НЦН-МТЗ     ",   \
  "    Блок.ЗДЗ    ",   \
  " Пуск ЗДЗ от ДВ ",   \
  " Свет ЗДЗ от ДВ ",   \
  "Свет ЗДЗ от ОВД1",   \
  "Свет ЗДЗ от ОВД2",   \
  "Свет ЗДЗ от ОВД3",   \
  "     ПО ЗДЗ     ",   \
  "      ЗДЗ       ",   \
  "    Блок.НЗЗ    ",   \
  "     ПО НЗЗ     ",   \
  "      НЗЗ       ",   \
  "  SGFP(3Io) SE  ",   \
  "   SGFP(3Io)    ",   \
  "   ПО ЗЗ(3U0)   ",   \
  "    ЗЗ(3U0)     ",   \
  "   Сектор НЗЗ   ",   \
  "   Блок.ТЗНП1   ",   \
  " Сект.ТЗНП1 Пр. ",   \
  " Сект.ТЗНП1 Обр.",   \
  "ПО 3I0 ТЗНП1 Пр.",   \
  "ПО 3I0 ТЗНП1 Обр",   \
  "ПО 3U0 ТЗНП1 Пр.",   \
  "ПО 3U0 ТЗНП1 Обр",   \
  "  ПО ТЗНП1 Пр.  ",   \
  " ПО ТЗНП1 Обр.  ",   \
  "     ТЗНП1      ",   \
  "   Блок.ТЗНП2   ",   \
  " Сект.ТЗНП2 Пр. ",   \
  " Сект.ТЗНП2 Обр.",   \
  "ПО 3I0 ТЗНП2 Пр.",   \
  "ПО 3I0 ТЗНП2 Обр",   \
  "ПО 3U0 ТЗНП2 Пр.",   \
  "ПО 3U0 ТЗНП2 Обр",   \
  "  ПО ТЗНП2 Пр.  ",   \
  " ПО ТЗНП2 Обр.  ",   \
  "     ТЗНП2      ",   \
  "   Блок.ТЗНП3   ",   \
  " Сект.ТЗНП3 Пр. ",   \
  " Сект.ТЗНП3 Обр.",   \
  "ПО 3I0 ТЗНП3 Пр.",   \
  "ПО 3I0 ТЗНП3 Обр",   \
  "ПО 3U0 ТЗНП3 Пр.",   \
  "ПО 3U0 ТЗНП3 Обр",   \
  "  ПО ТЗНП3 Пр.  ",   \
  " ПО ТЗНП3 Обр.  ",   \
  "     ТЗНП3      ",   \
  "Static Blc.of AR",   \
  "       AR       ",   \
  "      AR2       ",   \
  "      AR3       ",   \
  "      AR4       ",   \
  "   Работа АПВ   ",   \
  "UFLS/FAR from DI",   \
  "   Блок.АЧР1    ",   \
  "   Блок.АЧР2    ",   \
  "   Разр.ЧАПВ    ",   \
  "   Блок.ЧАПВ    ",   \
  "    ПО АЧР1     ",   \
  "   ПО ЧАПВ1     ",   \
  "   UFLS/FAR1    ",   \
  "    ПО АЧР2     ",   \
  "   ПО ЧАПВ2     ",   \
  "   UFLS/FAR2    ",   \
  " CBFP Start f.DI",   \
  "    CBFP SE     ",   \
  "     CBFP1      ",   \
  "     CBFP2      ",   \
  "  Blc.of NPSP   ",   \
  "    NPSP SE     ",   \
  "      NPSP      ",   \
  "   Блок.Umin1   ",   \
  "   Пуск Umin1   ",   \
  "   Блок.Umin2   ",   \
  "   Пуск Umin2   ",   \
  "    ПО Umin1    ",   \
  " ПО Uблк.Umin1  ",   \
  " ПО Iблк.Umin1  ",   \
  "     Umin1      ",   \
  "    ПО Umin2    ",   \
  " ПО Uблк.Umin2  ",   \
  " ПО Iблк.Umin2  ",   \
  "     Umin2      ",   \
  "   Блок.Umax1   ",   \
  "    ПО Umax1    ",   \
  "     Umax1      ",   \
  "   Блок.Umax2   ",   \
  "    ПО Umax2    ",   \
  "     Umax2      ",   \
  "   Blc.of UPx   ",   \
  "     UPx SE     ",   \
  "      UPx       ",   \
  "    UDF1 In     ",   \
  "    UDF1 Out    ",   \
  "    UDF2 In     ",   \
  "    UDF2 Out    ",   \
  "    UDF3 In     ",   \
  "    UDF3 Out    ",   \
  "    UDF4 In     ",   \
  "    UDF4 Out    ",   \
  "    UDF5 In     ",   \
  "    UDF5 Out    ",   \
  "    UDF6 In     ",   \
  "    UDF6 Out    ",   \
  "    UDF7 In     ",   \
  "    UDF7 Out    ",   \
  "    UDF8 In     ",   \
  "    UDF8 Out    ",   \
  "    UDF9 In     ",   \
  "    UDF9 Out    ",   \
  "    UDF10 In    ",   \
  "   UDF10 Out    ",   \
  "    UDF11 In    ",   \
  "   UDF11 Out    ",   \
  "    UDF12 In    ",   \
  "   UDF12 Out    ",   \
  "    UDF13 In    ",   \
  "   UDF13 Out    ",   \
  "    UDF14 In    ",   \
  "   UDF14 Out    ",   \
  "    UDF15 In    ",   \
  "   UDF15 Out    ",   \
  "    UDF16 In    ",   \
  "   UDF16 Out    ",   \
  "UD Flip-Flop1 S.",   \
  "UD Flip-Flop1 R.",   \
  "UD Flip-Flop1 O.",   \
  "UD Flip-Flop2 S.",   \
  "UD Flip-Flop2 R.",   \
  "UD Flip-Flop2 O.",   \
  "UD Flip-Flop3 S.",   \
  "UD Flip-Flop3 R.",   \
  "UD Flip-Flop3 O.",   \
  "UD Flip-Flop4 S.",   \
  "UD Flip-Flop4 R.",   \
  "UD Flip-Flop4 O.",   \
  "    UD AND1     ",   \
  "    UD AND2     ",   \
  "    UD AND3     ",   \
  "    UD AND4     ",   \
  "    UD AND5     ",   \
  "    UD AND6     ",   \
  "    UD AND7     ",   \
  "    UD AND8     ",   \
  "     UD OR1     ",   \
  "     UD OR2     ",   \
  "     UD OR3     ",   \
  "     UD OR4     ",   \
  "     UD OR5     ",   \
  "     UD OR6     ",   \
  "     UD OR7     ",   \
  "     UD OR8     ",   \
  "    UD XOR1     ",   \
  "    UD XOR2     ",   \
  "    UD XOR3     ",   \
  "    UD XOR4     ",   \
  "    UD XOR5     ",   \
  "    UD XOR6     ",   \
  "    UD XOR7     ",   \
  "    UD XOR8     ",   \
  "    UD NOT1     ",   \
  "    UD NOT2     ",   \
  "    UD NOT3     ",   \
  "    UD NOT4     ",   \
  "    UD NOT5     ",   \
  "    UD NOT6     ",   \
  "    UD NOT7     ",   \
  "    UD NOT8     ",   \
  "    UD NOT9     ",   \
  "    UD NOT10    ",   \
  "    UD NOT11    ",   \
  "    UD NOT12    ",   \
  "    UD NOT13    ",   \
  "    UD NOT14    ",   \
  "    UD NOT15    ",   \
  "    UD NOT16    ",   \
  "      СF1       ",   \
  "      СF2       ",   \
  "      СF3       ",   \
  "      СF4       ",   \
  "      СF5       ",   \
  "      СF6       ",   \
  "      СF7       ",   \
  "      СF8       ",   \
  "      СF9       ",   \
  "      СF10      ",   \
  "      СF11      ",   \
  "      СF12      ",   \
  "      СF13      ",   \
  "      СF14      ",   \
  "      СF15      ",   \
  "      СF16      ",   \
  " Ош.настр.р.лог."

#define NAME_RANG_KZ    \
  "  Блок.вкл.ВВ   ",   \
  " Сброс индикации",   \
  "   Сброс реле   ",   \
  " Местн./Дистанц.",   \
  "  Положение ВВ  ",   \
  "Откл.от вн.защит",   \
  "     Вкл.ВВ     ",   \
  " Контроль Вкл.  ",   \
  "    Откл.ВВ     ",   \
  " Контроль Откл. ",   \
  "   Привод ВВ    ",   \
  " Прев.Iот.ном.  ",   \
  " Крит.Ресурс ВВ ",   \
  " Исч.Ресурс ВВ  ",   \
  "  Неиспр.Общая  ",   \
  "  Неиспр.Авар.  ",   \
  " Работа Ан.Рег. ",   \
  " Работа Д.Рег.  ",   \
  " Откл.от защит  ",   \
  "       БО       ",   \
  "       БВ       ",   \
  "     1Ф КЗ      ",   \
  "     2Ф КЗ      ",   \
  "     3Ф КЗ      ",   \
  " 1-я гр.уставок ",   \
  " 2-я гр.уставок ",   \
  " 3-я гр.уставок ",   \
  " 4-я гр.уставок ",   \
  " Инв.ДВ гр.уст. ",   \
  "Блк.гр.уст.от з.",   \
  " С.блк.Гот.к ТУ ",   \
  " Готовность к ТУ",   \
  "  Изм.настроек  ",   \
  "    Блок.ДЗ1    ",   \
  "     ПО ДЗ1     ",   \
  "      ДЗ1       ",   \
  "  ПО АМТЗ ДЗ1   ",   \
  "    АМТЗ ДЗ1    ",   \
  "    Блок.ДЗ2    ",   \
  "  Блок.уск.ДЗ2  ",   \
  "   Оп.уск.ДЗ2   ",   \
  "  Сект.ДЗ2 Пр.  ",   \
  " Сект.ДЗ2 Обр.  ",   \
  "   ПО ДЗ2 Пр.   ",   \
  "  ПО ДЗ2 Обр.   ",   \
  "      ДЗ2       ",   \
  "  ПО АМТЗ ДЗ2   ",   \
  "    АМТЗ ДЗ2    ",   \
  "    Блок.ДЗ3    ",   \
  "  Блок.уск.ДЗ3  ",   \
  "   Оп.уск.ДЗ3   ",   \
  "  Сект.ДЗ3 Пр.  ",   \
  " Сект.ДЗ3 Обр.  ",   \
  "   ПО ДЗ3 Пр.   ",   \
  "  ПО ДЗ3 Обр.   ",   \
  "      ДЗ3       ",   \
  "  ПО АМТЗ ДЗ3   ",   \
  "    АМТЗ ДЗ3    ",   \
  "    Блок.ДЗ4    ",   \
  "  Блок.уск.ДЗ4  ",   \
  "   Оп.уск.ДЗ4   ",   \
  "  Сект.ДЗ4 Пр.  ",   \
  " Сект.ДЗ4 Обр.  ",   \
  "   ПО ДЗ4 Пр.   ",   \
  "  ПО ДЗ4 Обр.   ",   \
  "      ДЗ4       ",   \
  "  ПО АМТЗ ДЗ4   ",   \
  "    АМТЗ ДЗ4    ",   \
  "   Вн.НЦН ДЗ    ",   \
  "     НЦН ДЗ     ",   \
  "    ПО U ДЗ     ",   \
  "  ПО I Блк.ДЗ   ",   \
  "3Ф ДЗ (Пр./Обр.)",   \
  "    СНЦН ДЗ     ",   \
  "   Блок.МТЗ1    ",   \
  "   Блок.МТЗ2    ",   \
  " Блок.уск.МТЗ2  ",   \
  "   Блок.МТЗ3    ",   \
  "   Блок.МТЗ4    ",   \
  " Сект.МТЗН1 Пр. ",   \
  " Сект.МТЗН1 Обр.",   \
  "    ПО МТЗ1     ",   \
  " ПО МТЗН1 Прямой",   \
  " ПО МТЗН1 Обр.  ",   \
  "  ПО U МТЗПН1   ",   \
  "   ПО МТЗПН1    ",   \
  "      МТЗ1      ",   \
  " Сект.МТЗН2 Пр. ",   \
  " Сект.МТЗН2 Обр.",   \
  "    ПО МТЗ2     ",   \
  " ПО МТЗН2 Прямой",   \
  " ПО МТЗН2 Обр.  ",   \
  "  ПО U МТЗПН2   ",   \
  "   ПО МТЗПН2    ",   \
  "      МТЗ2      ",   \
  " Сект.МТЗН3 Пр. ",   \
  " Сект.МТЗН3 Обр.",   \
  "    ПО МТЗ3     ",   \
  " ПО МТЗН3 Прямой",   \
  " ПО МТЗН3 Обр.  ",   \
  "  ПО U МТЗПН3   ",   \
  "   ПО МТЗПН3    ",   \
  "      МТЗ3      ",   \
  " Сект.МТЗН4 Пр. ",   \
  " Сект.МТЗН4 Обр.",   \
  "    ПО МТЗ4     ",   \
  " ПО МТЗН4 Прямой",   \
  " ПО МТЗН4 Обр.  ",   \
  "  ПО U МТЗПН4   ",   \
  "   ПО МТЗПН4    ",   \
  "      МТЗ4      ",   \
  " ПО блок.U МТЗН ",   \
  "    НЦН-МТЗ     ",   \
  "    Блок.ЗДЗ    ",   \
  " Пуск ЗДЗ от ДВ ",   \
  " Свет ЗДЗ от ДВ ",   \
  "Свет ЗДЗ от ОВД1",   \
  "Свет ЗДЗ от ОВД2",   \
  "Свет ЗДЗ от ОВД3",   \
  "     ПО ЗДЗ     ",   \
  "      ЗДЗ       ",   \
  "    Блок.НЗЗ    ",   \
  "     ПО НЗЗ     ",   \
  "      НЗЗ       ",   \
  "   ПО ЗЗ(3I0)   ",   \
  "    ЗЗ(3I0)     ",   \
  "   ПО ЗЗ(3U0)   ",   \
  "    ЗЗ(3U0)     ",   \
  "   Сектор НЗЗ   ",   \
  "   Блок.ТЗНП1   ",   \
  " Сект.ТЗНП1 Пр. ",   \
  " Сект.ТЗНП1 Обр.",   \
  "ПО 3I0 ТЗНП1 Пр.",   \
  "ПО 3I0 ТЗНП1 Обр",   \
  "ПО 3U0 ТЗНП1 Пр.",   \
  "ПО 3U0 ТЗНП1 Обр",   \
  "  ПО ТЗНП1 Пр.  ",   \
  " ПО ТЗНП1 Обр.  ",   \
  "     ТЗНП1      ",   \
  "   Блок.ТЗНП2   ",   \
  " Сект.ТЗНП2 Пр. ",   \
  " Сект.ТЗНП2 Обр.",   \
  "ПО 3I0 ТЗНП2 Пр.",   \
  "ПО 3I0 ТЗНП2 Обр",   \
  "ПО 3U0 ТЗНП2 Пр.",   \
  "ПО 3U0 ТЗНП2 Обр",   \
  "  ПО ТЗНП2 Пр.  ",   \
  " ПО ТЗНП2 Обр.  ",   \
  "     ТЗНП2      ",   \
  "   Блок.ТЗНП3   ",   \
  " Сект.ТЗНП3 Пр. ",   \
  " Сект.ТЗНП3 Обр.",   \
  "ПО 3I0 ТЗНП3 Пр.",   \
  "ПО 3I0 ТЗНП3 Обр",   \
  "ПО 3U0 ТЗНП3 Пр.",   \
  "ПО 3U0 ТЗНП3 Обр",   \
  "  ПО ТЗНП3 Пр.  ",   \
  " ПО ТЗНП3 Обр.  ",   \
  "     ТЗНП3      ",   \
  " Стат.блок.АПВ  ",   \
  "      АПВ       ",   \
  "      АПВ2      ",   \
  "      АПВ3      ",   \
  "      АПВ4      ",   \
  "   Работа АПВ   ",   \
  " АЧР/ЧАПВ от ДВ ",   \
  "   Блок.АЧР1    ",   \
  "   Блок.АЧР2    ",   \
  "   Разр.ЧАПВ    ",   \
  "   Блок.ЧАПВ    ",   \
  "    ПО АЧР1     ",   \
  "    ПО ЧАПВ1    ",   \
  "   АЧР/ЧАПВ1    ",   \
  "    ПО АЧР2     ",   \
  "    ПО ЧАПВ2    ",   \
  "   АЧР/ЧАПВ2    ",   \
  " Пуск УРОВ от ДВ",   \
  "    ПО УРОВ     ",   \
  "     УРОВ1      ",   \
  "     УРОВ2      ",   \
  " Блок.ЗОП(КОФ)  ",   \
  "  ПО ЗОП(КОФ)   ",   \
  "    ЗОП(КОФ)    ",   \
  "  Блок.ЗНмин1   ",   \
  "  Пуск ЗНмин1   ",   \
  "  Блок.ЗНмин2   ",   \
  "  Пуск ЗНмин2   ",   \
  "   ПО ЗНмин1    ",   \
  " ПО Uблк.ЗНмин1 ",   \
  " ПО Iблк.ЗНмин1 ",   \
  "     ЗНмин1     ",   \
  "     ПО ЗНмин2  ",   \
  " ПО Uблк.ЗНмин2 ",   \
  " ПО Iблк.ЗНмин2 ",   \
  "     ЗНмин2     ",   \
  "  Блок.ЗНмакс1  ",   \
  "   ПО ЗНмакс1   ",   \
  "    ЗНмакс1     ",   \
  "  Блок.ЗНмакс2  ",   \
  "   ПО ЗНмакс2   ",   \
  "    ЗНмакс2     ",   \
  "    Блок.УЗx    ",   \
  "     ПО УЗx     ",   \
  "      УЗx       ",   \
  " Вх.О-функции1  ",   \
  " Вых.О-функции1 ",   \
  " Вх.О-функции2  ",   \
  " Вых.О-функции2 ",   \
  " Вх.О-функции3  ",   \
  " Вых.О-функции3 ",   \
  " Вх.О-функции4  ",   \
  " Вых.О-функции4 ",   \
  " Вх.О-функции5  ",   \
  " Вых.О-функции5 ",   \
  " Вх.О-функции6  ",   \
  " Вых.О-функции6 ",   \
  " Вх.О-функции7  ",   \
  " Вых.О-функции7 ",   \
  " Вх.О-функции8  ",   \
  " Вых.О-функции8 ",   \
  " Вх.О-функции9  ",   \
  " Вых.О-функции9 ",   \
  " Вх.О-функции10 ",   \
  " Вых.О-функции10",   \
  " Вх.О-функции11 ",   \
  " Вых.О-функции11",   \
  " Вх.О-функции12 ",   \
  " Вых.О-функции12",   \
  " Вх.О-функции13 ",   \
  " Вых.О-функции13",   \
  " Вх.О-функции14 ",   \
  " Вых.О-функции14",   \
  " Вх.О-функции15 ",   \
  " Вых.О-функции15",   \
  " Вх.О-функции16 ",   \
  " Вых.О-функции16",   \
  " Уст.О-триггера1",   \
  " Сбр.О-триггера1",   \
  " Вых.О-триггера1",   \
  " Уст.О-триггера2",   \
  " Сбр.О-триггера2",   \
  " Вых.О-триггера2",   \
  " Уст.О-триггера3",   \
  " Сбр.О-триггера3",   \
  " Вых.О-триггера3",   \
  " Уст.О-триггера4",   \
  " Сбр.О-триггера4",   \
  " Вых.О-триггера4",   \
  "      О-И1      ",   \
  "      О-И2      ",   \
  "      О-И3      ",   \
  "      О-И4      ",   \
  "      О-И5      ",   \
  "      О-И6      ",   \
  "      О-И7      ",   \
  "      О-И8      ",   \
  "     О-ИЛИ1     ",   \
  "     О-ИЛИ2     ",   \
  "     О-ИЛИ3     ",   \
  "     О-ИЛИ4     ",   \
  "     О-ИЛИ5     ",   \
  "     О-ИЛИ6     ",   \
  "     О-ИЛИ7     ",   \
  "     О-ИЛИ8     ",   \
  "  О-Искл.ИЛИ1   ",   \
  "  О-Искл.ИЛИ2   ",   \
  "  О-Искл.ИЛИ3   ",   \
  "  О-Искл.ИЛИ4   ",   \
  "  О-Искл.ИЛИ5   ",   \
  "  О-Искл.ИЛИ6   ",   \
  "  О-Искл.ИЛИ7   ",   \
  "  О-Искл.ИЛИ8   ",   \
  "     О-НЕ1      ",   \
  "     О-НЕ2      ",   \
  "     О-НЕ3      ",   \
  "     О-НЕ4      ",   \
  "     О-НЕ5      ",   \
  "     О-НЕ6      ",   \
  "     О-НЕ7      ",   \
  "     О-НЕ8      ",   \
  "     О-НЕ9      ",   \
  "     О-НЕ10     ",   \
  "     О-НЕ11     ",   \
  "     О-НЕ12     ",   \
  "     О-НЕ13     ",   \
  "     О-НЕ14     ",   \
  "     О-НЕ15     ",   \
  "     О-НЕ16     ",   \
  "      ФС1       ",   \
  "      ФС2       ",   \
  "      ФС3       ",   \
  "      ФС4       ",   \
  "      ФС5       ",   \
  "      ФС6       ",   \
  "      ФС7       ",   \
  "      ФС8       ",   \
  "      ФС9       ",   \
  "      ФС10      ",   \
  "      ФС11      ",   \
  "      ФС12      ",   \
  "      ФС13      ",   \
  "      ФС14      ",   \
  "      ФС15      ",   \
  "      ФС16      ",   \
  " Ош.настр.р.лог."

#ifndef NAME_RANG_A01_RU_   
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//!~~~@     RU BEGIN  NAMES             ~~~~
//!~~~@     RU BEGIN  NAMES             ~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//`````````````````````````````````````````````````````````````````````````````````` 

#define NAME_RANG_A01_RU    \
  "  Блок.вкл.ВВО  ",   \
  "  Блок.вкл.ВВР  ",   \
  " Сброс индикации",   \
  "   Сброс реле   ",   \
  " Местн./Дистанц.",   \
  "  Положение ВВР ",   \
  "  Положение ВВО ",   \
  "     Вкл.ВВО    ",   \
  "     Вкл.ВВР    ",   \
  "Контр.  Вкл.ВВО ",   \
  "Контр.  Вкл.ВВР ",   \
  "    Откл.ВВО    ",   \
  "    Откл.ВВР    ",   \
  "Контрол.Откл.ВВО",   \
  "Контрол.Откл.ВВР",   \
  "   Привод ВВО   ",   \
  "   Привод ВВР   ",   \
  "    НЦНО        ",   \
  "    НЦНР        ",   \
  " Прев.Iот.ном.  ",   \
  " Крит.Ресурс ВВО",   \
  " Исч.Ресурс ВВО ",   \
  "  Неиспр.Общая  ",   \
  "  Неиспр.Авар.  ",   \
  " Работа Ан.Рег. ",   \
  " Работа Д.Рег.  ",   \
  " Откл.от защ.ВВО",   \
  " Откл.от защ.ВВР",   \
  "       БО ВО    ",   \
  "       БО ВР    ",   \
  "       БВ ВО    ",   \
  "       БВ ВР    ",   \
  " 1-я гр.уставок ",   \
  " 2-я гр.уставок ",   \
  " 3-я гр.уставок ",   \
  " 4-я гр.уставок ",   \
  " Инв.ДВ гр.уст. ",   \
  "Блк.гр.уст.от з.",   \
  " С.блк.Гот.к ТУ ",   \
  " Готовность к ТУ",   \
  "  Изм.настроек  ",   \
  "   Вн.НЦН ДЗО   ",   \
  "Запр.Блк.ДЗО1 I3",   \
  "Запр.Блк.ДЗО1 IО",   \
  "    Блок.ДЗО1   ",   \
  "  ПО IО<Iп ДЗО  ",   \
  "ПО IО3/IО1 ДЗО  ",   \
  "Блк.ДЗО1 IО3/IО1",   \
  "Блк.ДЗО1 по IОсн",   \
  "    НЦН ДЗО     ",   \
  "   СНЦН ДЗО     ",   \
  "  ПО ДЗО UО<Uп  ",   \
  " ПО2 IБлк.ДЗО1  ",   \
  " Блокир.   ДЗО1 ",   \
  "     ПО ДЗО1    ",   \
  "      ДЗО1      ",   \
  "  ПО АМТЗ ДЗО1  ",   \
  "    АМТЗ ДЗО1   ",   \
  "  Блок.уск.ДЗО2 ",   \
  "   Оп.уск.ДЗО2  ",   \
  "Запр.Блк.ДЗО2 I3",   \
  "    Блок.ДЗ2    ",   \
  "Блк.ДЗО2 IО3/IО1",   \
  " Блокир.   ДЗО2 ",   \
  "  Сект.ДЗО2 Пр. ",   \
  " Сект.ДЗО2 Обр. ",   \
  "   ПО ДЗО2 Пр.  ",   \
  "  ПО ДЗО2 Обр.  ",   \
  "      ДЗО2      ",   \
  "    АМТЗ ДЗО2   ",   \
  "  ПО АМТЗ ДЗО2  ",   \
  "  Блок.уск.ДЗО3 ",   \
  "   Оп.уск.ДЗО3  ",   \
  "Запр.Блк.ДЗО3 I3",   \
  "    Блок.ДЗО3   ",   \
  "Блк.ДЗО3 IО3/IО1",   \
  " Блокир.   ДЗО3 ",   \
  "  Сект.ДЗО3 Пр. ",   \
  " Сект.ДЗО3 Обр. ",   \
  "   ПО ДЗО3 Пр.  ",   \
  "  ПО ДЗО3 Обр.  ",   \
  "      ДЗО3      ",   \
  "    АМТЗ ДЗО3   ",   \
  "  ПО АМТЗ ДЗО3  ",   \
  "Запр.Блк.ДЗО4 I3",   \
  "    Блок.ДЗО4   ",   \
  "Блк.ДЗО4 IО3/IО1",   \
  " Блокир.   ДЗО4 ",   \
  "  Напр.ДЗО4 Пр. ",   \
  " Напр.ДЗО4 Обр. ",   \
  "   ПО ДЗО4 Пр.  ",   \
  "  ПО ДЗО4 Обр.  ",   \
  "      ДЗО4      ",   \
  "    АМТЗ ДЗО4   ",   \
  "  ПО АМТЗ ДЗО4  ",   \
  "    Блок.ЗДЗ    ",   \
  " Пуск ЗДЗ от ДВ ",   \
  " Свет ЗДЗ от ДВ ",   \
  "Свет ЗДЗ от ОВД1",   \
  "Свет ЗДЗ от ОВД2",   \
  "Свет ЗДЗ от ОВД3",   \
  "     ПО ЗДЗ     ",   \
  "      ЗДЗ       ",   \
  "    НЦН-МТЗО    ",   \
  " ПО блок.U МТЗО ",   \
  "   Блок.МТЗО1   ",   \
  " ПО U МТЗОПН1   ",   \
  "Сект.МТЗОН1 Пр. ",   \
  "Сект.МТЗОН1 Обр.",   \
  "   ПО МТЗО1     ",   \
  "ПО МТЗОН1 Прямой",   \
  "ПО МТЗОН1 Обр.  ",   \
  "  ПО МТЗОПН1    ",   \
  "     МТЗО1      ",   \
  "   Блок.МТЗО2   ",   \
  " Блок.уск.МТЗО2 ",   \
  " ПО U МТЗОПН2   ",   \
  "Сект.МТЗОН2 Пр. ",   \
  "Сект.МТЗОН2 Обр.",   \
  "   ПО МТЗО2     ",   \
  "ПО МТЗОН2 Прямой",   \
  "ПО МТЗОН2 Обр.  ",   \
  "  ПО МТЗОПН2    ",   \
  "     МТЗО2      ",   \
  "   Блок.МТЗО3   ",   \
  " ПО U МТЗОПН3   ",   \
  "Сект.МТЗОН3 Пр. ",   \
  "Сект.МТЗОН3 Обр.",   \
  "   ПО МТЗО3     ",   \
  "ПО МТЗОН3 Прямой",   \
  "ПО МТЗОН3 Обр.  ",   \
  "  ПО МТЗОПН3    ",   \
  "     МТЗО3      ",   \
  "   Блок.МТЗО4   ",   \
  " ПО U МТЗОПН4   ",   \
  "Сект.МТЗОН4 Пр. ",   \
  "Сект.МТЗОН4 Обр.",   \
  "   ПО МТЗО4     ",   \
  "ПО МТЗОН4 Прямой",   \
  "ПО МТЗОН4 Обр.  ",   \
  "  ПО МТЗОПН4    ",   \
  "     МТЗО4      ",   \
  "    НЦН-МТЗР    ",   \
  " ПО блок.U МТЗР ",   \
  "   Блок.МТЗР1   ",   \
  " ПО U МТЗРПН1   ",   \
  "Сект.МТЗРН1 Пр. ",   \
  "Сект.МТЗРН1 Обр.",   \
  "   ПО МТЗР1     ",   \
  "ПО МТЗРН1 Прямой",   \
  "ПО МТЗРН1 Обр.  ",   \
  "  ПО МТЗРПН1    ",   \
  "     МТЗР1      ",   \
  "   Блок.МТЗР2   ",   \
  " ПО U МТЗРПН2   ",   \
  "Сект.МТЗРН2 Пр. ",   \
  "Сект.МТЗРН2 Обр.",   \
  "   ПО МТЗР2     ",   \
  "ПО МТЗРН2 Прямой",   \
  "ПО МТЗРН2 Обр.  ",   \
  "  ПО МТЗРПН2    ",   \
  "     МТЗР2      ",   \
  " Стат.блок.АПВ  ",   \
  "      АПВ       ",   \
  "      АПВ2      ",   \
  "      АПВ3      ",   \
  "      АПВ4      ",   \
  "   Работа АПВ   ",   \
  " АЧР/ЧАПВ от ДВ ",   \
  "   Блок.АЧР1    ",   \
  "   Блок.АЧР2    ",   \
  "   Разр.ЧАПВ    ",   \
  "  Блок.ЧАПВ от U",   \
  "    ПО АЧР1     ",   \
  "    ПО ЧАПВ1    ",   \
  "   АЧР/ЧАПВ1    ",   \
  "    ПО АЧР2     ",   \
  "    ПО ЧАПВ2    ",   \
  "   АЧР/ЧАПВ2    ",   \
  " Пуск УРОВ от ДВ",   \
  "    ПО УРОВ     ",   \
  "     УРОВ1      ",   \
  "     УРОВ2      ",   \
  "   Вн.НЦН ДЗР   ",   \
  "Запр.Блк.ДЗР1 I3",   \
  "Запр.Блк.ДЗР1 IP",   \
  "    Блок.ДЗР1   ",   \
  "  ПО IР<Iп ДЗР  ",   \
  "ПО IР3/IР1 ДЗР  ",   \
  "Блк.ДЗР1 IР3/IР1",   \
  "Блк.ДЗР1 по IРез",   \
  "    НЦН ДЗР     ",   \
  "   СНЦН ДЗР     ",   \
  "ПО ДЗР UР<Uп ДЗР",   \
  " ПО2 IБлк.ДЗР1  ",   \
  " Блокир.   ДЗР1 ",   \
  "     ПО ДЗР1    ",   \
  "      ДЗР1      ",   \
  "  ПО АМТЗ ДЗР1  ",   \
  "    АМТЗ ДЗР1   ",   \
  "  Блок.уск.ДЗР2 ",   \
  "   Оп.уск.ДЗР2  ",   \
  "Запр.Блк.ДЗР2 I3",   \
  "    Блок.ДЗ2    ",   \
  "Блк.ДЗР2 IР3/IР1",   \
  " Блокир.   ДЗР2 ",   \
  "  Сект.ДЗР2 Пр. ",   \
  " Сект.ДЗР2 Обр. ",   \
  "   ПО ДЗР2 Пр.  ",   \
  "  ПО ДЗР2 Обр.  ",   \
  "      ДЗР2      ",   \
  "    АМТЗ ДЗР2   ",   \
  "  ПО АМТЗ ДЗР2  ",   \
  "  Блок.уск.ДЗР3 ",   \
  "   Оп.уск.ДЗР3  ",   \
  "Запр.Блк.ДЗР3 I3",   \
  "    Блок.ДЗР3   ",   \
  "Блк.ДЗР3 IР3/IР1",   \
  " Блокир.   ДЗР3 ",   \
  "  Сект.ДЗР3 Пр. ",   \
  " Сект.ДЗР3 Обр. ",   \
  "   ПО ДЗР3 Пр.  ",   \
  "  ПО ДЗР3 Обр.  ",   \
  "      ДЗР3      ",   \
  "    АМТЗ ДЗР3   ",   \
  "  ПО АМТЗ ДЗР3  ",   \
  "  Блок.ЗНмин1   ",   \
  "  Пуск ЗНмин1   ",   \
  "  Блок.ЗНмин2   ",   \
  "  Пуск ЗНмин2   ",   \
  "   ПО ЗНмин1    ",   \
  " ПО Uблк.ЗНмин1 ",   \
  " ПО Iблк.ЗНмин1 ",   \
  "     ЗНмин1     ",   \
  "     ПО ЗНмин2  ",   \
  " ПО Uблк.ЗНмин2 ",   \
  " ПО Iблк.ЗНмин2 ",   \
  "     ЗНмин2     ",   \
  "  Блок.ЗНмакс1  ",   \
  "   ПО ЗНмакс1   ",   \
  "    ЗНмакс1     ",   \
  "  Блок.ЗНмакс2  ",   \
  "   ПО ЗНмакс2   ",   \
  "    ЗНмакс2     ",   \
  "    Блок.УЗx    ",   \
  "     ПО УЗx     ",   \
  "      УЗx       ",   \
  " Вх.О-функции1  ",   \
  " Сбр.О-функции1 ",   \
  " Вых.О-функции1 ",   \
  " Вх.О-функции2  ",   \
  " Сбр.О-функции2 ",   \
  " Вых.О-функции2 ",   \
  " Вх.О-функции3  ",   \
  " Сбр.О-функции3 ",   \
  " Вых.О-функции3 ",   \
  " Вх.О-функции4  ",   \
  " Сбр.О-функции4 ",   \
  " Вых.О-функции4 ",   \
  " Вх.О-функции5  ",   \
  " Сбр.О-функции5 ",   \
  " Вых.О-функции5 ",   \
  " Вх.О-функции6  ",   \
  " Сбр.О-функции6 ",   \
  " Вых.О-функции6 ",   \
  " Вх.О-функции7  ",   \
  " Сбр.О-функции7 ",   \
  " Вых.О-функции7 ",   \
  " Вх.О-функции8  ",   \
  " Сбр.О-функции8 ",   \
  " Вых.О-функции8 ",   \
  " Вх.О-функции9  ",   \
  " Сбр.О-функции9 ",   \
  " Вых.О-функции9 ",   \
  " Вх.О-функции10 ",   \
  " Сбр.О-функции10",   \
  " Вых.О-функции10",   \
  " Вх.О-функции11 ",   \
  " Сбр.О-функции11",   \
  " Вых.О-функции11",   \
  " Вх.О-функции12 ",   \
  " Сбр.О-функции12",   \
  " Вых.О-функции12",   \
  " Вх.О-функции13 ",   \
  " Сбр.О-функции13",   \
  " Вых.О-функции13",   \
  " Вх.О-функции14 ",   \
  " Сбр.О-функции14",   \
  " Вых.О-функции14",   \
  " Вх.О-функции15 ",   \
  " Сбр.О-функции15",   \
  " Вых.О-функции15",   \
  " Вх.О-функции16 ",   \
  " Сбр.О-функции16",   \
  " Вых.О-функции16",   \
  " Уст.О-триггера1",   \
  " Сбр.О-триггера1",   \
  " Вых.О-триггера1",   \
  " Уст.О-триггера2",   \
  " Сбр.О-триггера2",   \
  " Вых.О-триггера2",   \
  " Уст.О-триггера3",   \
  " Сбр.О-триггера3",   \
  " Вых.О-триггера3",   \
  " Уст.О-триггера4",   \
  " Сбр.О-триггера4",   \
  " Вых.О-триггера4",   \
  "      О-И1      ",   \
  "      О-И2      ",   \
  "      О-И3      ",   \
  "      О-И4      ",   \
  "      О-И5      ",   \
  "      О-И6      ",   \
  "      О-И7      ",   \
  "      О-И8      ",   \
  "     О-ИЛИ1     ",   \
  "     О-ИЛИ2     ",   \
  "     О-ИЛИ3     ",   \
  "     О-ИЛИ4     ",   \
  "     О-ИЛИ5     ",   \
  "     О-ИЛИ6     ",   \
  "     О-ИЛИ7     ",   \
  "     О-ИЛИ8     ",   \
  "  О-Искл.ИЛИ1   ",   \
  "  О-Искл.ИЛИ2   ",   \
  "  О-Искл.ИЛИ3   ",   \
  "  О-Искл.ИЛИ4   ",   \
  "  О-Искл.ИЛИ5   ",   \
  "  О-Искл.ИЛИ6   ",   \
  "  О-Искл.ИЛИ7   ",   \
  "  О-Искл.ИЛИ8   ",   \
  "     О-НЕ1      ",   \
  "     О-НЕ2      ",   \
  "     О-НЕ3      ",   \
  "     О-НЕ4      ",   \
  "     О-НЕ5      ",   \
  "     О-НЕ6      ",   \
  "     О-НЕ7      ",   \
  "     О-НЕ8      ",   \
  "     О-НЕ9      ",   \
  "     О-НЕ10     ",   \
  "     О-НЕ11     ",   \
  "     О-НЕ12     ",   \
  "     О-НЕ13     ",   \
  "     О-НЕ14     ",   \
  "     О-НЕ15     ",   \
  "     О-НЕ16     ",   \
  "      ФС1       ",   \
  "      ФС2       ",   \
  "      ФС3       ",   \
  "      ФС4       ",   \
  "      ФС5       ",   \
  "      ФС6       ",   \
  "      ФС7       ",   \
  "      ФС8       ",   \
  "      ФС9       ",   \
  "      ФС10      ",   \
  "      ФС11      ",   \
  "      ФС12      ",   \
  "      ФС13      ",   \
  "      ФС14      ",   \
  "      ФС15      ",   \
  "      ФС16      ",   \
  " Ош.настр.р.лог."
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//!~~~$                                          RU END NAMES         ~~~~~
//!~~~$                                          RU END NAMES         ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
#endif //NAME_RANG_A01_RU_

#ifndef NAME_RANG_A01_UA_
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//!~~~@     UA BEGIN  NAMES             ~~~~
//!~~~@     UA BEGIN  NAMES             ~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//`````````````````````````````````````````````````````````````````````````````````` 
#define NAME_RANG_A01_UA    \
  "Блок.увімкн.ВВО ",   \
  "Блок.увімкн.ВВР ",   \
  " Скид.індикації ",   \
  "   Скид.реле    ",   \
  " Місц./Дистанц. ",   \
  "    Стан ВВР    ",   \
  "    Стан ВВО    ",   \
  "    Увімк.ВВО   ",   \
  "    Увімк.ВВР   ",   \
  "Контр. Увімк.ВО ",   \
  "Контр. Увімк.ВР ",   \
  "    Вимк.ВО     ",   \
  "    Вимк.ВР     ",   \
  " Контр.Вимк.ВВО ",   \
  " Контр.Вимк.ВВР ",   \
  "   Привід ВВО   ",   \
  "   Привід ВВР   ",   \
  "    НКНО        ",   \
  "    НКНР        ",   \
  " Перев.Iв.ном.  ",   \
  " Крит.Ресурс ВВО",   \
  " Вич.Ресурс ВВО ",   \
  " Неспр.Загальна ",   \
  "  Неспр.Авар.   ",   \
  " Роб.Ан.Реєстр. ",   \
  " Роб.Д.Реєстр.  ",   \
  "Вимк.від зах.ВВО",   \
  "Вимк.від зах.ВВР",   \
  "     БВимк.ВО   ",   \
  "     БВимк.ВР   ",   \
  "    БУвімк.ВО   ",   \
  "    БУвімк.ВР   ",   \
  " 1-а гр.уставок ",   \
  " 2-а гр.уставок ",   \
  " 3-а гр.уставок ",   \
  " 4-а гр.уставок ",   \
  " Інв.ДВ гр.уст. ",   \
  "Бл.гр.уст.від з.",   \
  " С.блк.Гот.до ТУ",   \
  "Готовність до ТУ",   \
  " Зм.налаштування",   \
  "  Зовн.НКН ДЗО  ",   \
  "Збр.Блк.ДЗО1 I3 ",   \
  "Збр.Блк.ДЗО1 IО ",   \
  "    Блок.ДЗО1   ",   \
  "  ПО IО<Iп ДЗО  ",   \
  "ПО IО3/IО1 ДЗО  ",   \
  "Блк.ДЗО1 IO3/IO1",   \
  "Блк.ДЗО1 по IОсн",   \
  "    НКН ДЗО     ",   \
  "   СНКН ДЗО     ",   \
  "  ПО ДЗО UО<Uп  ",   \
  " ПО2 IБлк.ДЗО1  ",   \
  " Блокув.   ДЗО1 ",   \
  "     ПО ДЗО1    ",   \
  "      ДЗО1      ",   \
  "  ПО АМСЗ ДЗО1  ",   \
  "    АМСЗ ДЗО1   ",   \
  "  Блок.пр.ДЗО2  ",   \
  "   Оп.пр.ДЗО2   ",   \
  " Збр.Блк.ДЗО2 I3",   \
  "    Блок.ДЗО2   ",   \
  "Блк.ДЗО2 IО3/IО1",   \
  " Блокув.   ДЗО2 ",   \
  "  Сект.ДЗО2 Пр. ",   \
  "  Сект.ДЗО2 Зв. ",   \
  "   ПО ДЗО2 Пр.  ",   \
  "   ПО ДЗО2 Зв.  ",   \
  "      ДЗО2      ",   \
  "    АМСЗ ДЗО2   ",   \
  "  ПО АМСЗ ДЗО2  ",   \
  "  Блок.пр.ДЗО3  ",   \
  "   Оп.пр.ДЗ3    ",   \
  " Збр.Блк.ДЗО3 I3",   \
  "    Блок.ДЗО3   ",   \
  "Блк.ДЗО3 IО3/IО1",   \
  " Блокир.   ДЗО3 ",   \
  "  Сект.ДЗО3 Пр. ",   \
  "  Сект.ДЗО3 Зв. ",   \
  "   ПО ДЗО3 Пр.  ",   \
  "   ПО ДЗО3 Зв.  ",   \
  "      ДЗО3      ",   \
  "    АМСЗ ДЗО3   ",   \
  "  ПО АМСЗ ДЗО3  ",   \
  " Збр.Блк.ДЗО4 I3",   \
  "    Блок.ДЗО4   ",   \
  "Блк.ДЗО4 IО3/IО1",   \
  " Блокув.   ДЗО4 ",   \
  "  Напр.ДЗО4 Пр. ",   \
  " Напр.ДЗО4 Зв.  ",   \
  "   ПО ДЗО4 Пр.  ",   \
  "   ПО ДЗО4 Зв.  ",   \
  "      ДЗО4      ",   \
  "    АМСЗ ДЗО4   ",   \
  "  ПО АМСЗ ДЗО4  ",   \
  "    Блок.ЗДЗ    ",   \
  " Пуск ЗДЗ від ДВ",   \
  " Св.ЗДЗ від ДВ  ",   \
  " Св.ЗДЗ від ОВД1",   \
  " Св.ЗДЗ від ОВД2",   \
  " Св.ЗДЗ від ОВД3",   \
  "     ПО ЗДЗ     ",   \
  "      ЗДЗ       ",   \
  "    НКН-МСЗО    ",   \
  " ПО блок.U МСЗО ",   \
  "   Блок.МСЗО1   ",   \
  " ПО U МСЗОПН1   ",   \
  "Сект.МСЗОН1 Пр. ",   \
  "Сект.МСЗОН1 Зв .",   \
  "   ПО МСЗО1     ",   \
  "ПО МСЗОН1 Пр.   ",   \
  "ПО МСЗОН1 Зв.   ",   \
  "  ПО МСЗОПН1    ",   \
  "     МСЗО1      ",   \
  "   Блок.МСЗО2   ",   \
  " Блок.пр.МСЗО2  ",   \
  " ПО U МСЗОПН2   ",   \
  "Сект.МСЗОН2 Пр. ",   \
  "Сект.МСЗОН2 Зв. ",   \
  "   ПО МСЗО2     ",   \
  "ПО МСЗОН2 Пр.   ",   \
  "ПО МСЗОН2 Зв.   ",   \
  "  ПО МСЗОПН2    ",   \
  "     МСЗО2      ",   \
  "   Блок.МСЗО3   ",   \
  " ПО U МСЗОПН3   ",   \
  "Сект.МСЗОН3 Пр. ",   \
  "Сект.МСЗОН3 Зв. ",   \
  "   ПО МСЗО3     ",   \
  "ПО МСЗОН3 Пр.   ",   \
  "ПО МСЗОН3 Зв.   ",   \
  "  ПО МСЗОПН3    ",   \
  "     МСЗО3      ",   \
  "   Блок.МСЗО4   ",   \
  " ПО U МСЗОПН4   ",   \
  "Сект.МСЗОН4 Пр. ",   \
  "Сект.МСЗОН4 Зв. ",   \
  "   ПО МСЗО4     ",   \
  "ПО МСЗОН4 Пр.   ",   \
  "ПО МСЗОН4 Зв.   ",   \
  "  ПО МСЗОПН4    ",   \
  "     МСЗО4      ",   \
  "    НКН-МСЗР    ",   \
  " ПО блок.U МСЗР ",   \
  "   Блок.МСЗР1   ",   \
  " ПО U МСЗРПН1   ",   \
  "Сект.МСЗРН1 Пр. ",   \
  "Сект.МСЗРН1 Зв. ",   \
  "   ПО МСЗР1     ",   \
  "ПО МСЗРН1 Пр.   ",   \
  "ПО МСЗРН1 Зв.   ",   \
  "  ПО МСЗРПН1    ",   \
  "     МСЗР1      ",   \
  "   Блок.МСЗР2   ",   \
  " ПО U МСЗРПН2   ",   \
  "Сект.МСЗРН2 Пр. ",   \
  "Сект.МСЗРН2 Зв. ",   \
  "   ПО МСЗР2     ",   \
  "ПО МСЗРН2 Пр.   ",   \
  "ПО МСЗРН2 Зв.   ",   \
  "  ПО МСЗРПН2    ",   \
  "     МСЗР2      ",   \
  " Стат.блок.АПВ  ",   \
  "      АПВ       ",   \
  "      АПВ2      ",   \
  "      АПВ3      ",   \
  "      АПВ4      ",   \
  "   Робота АПВ   ",   \
  " АЧР/ЧАПВ від ДВ",   \
  "   Блок.АЧР1    ",   \
  "   Блок.АЧР2    ",   \
  "  Дозвіл ЧАПВ   ",   \
  "   Блок.ЧАПВ    ",   \
  "    ПО АЧР1     ",   \
  "    ПО ЧАПВ1    ",   \
  "   АЧР/ЧАПВ1    ",   \
  "    ПО АЧР2     ",   \
  "    ПО ЧАПВ2    ",   \
  "   АЧР/ЧАПВ2    ",   \
  "Пуск ПРВВ від ДВ",   \
  "    ПО ПРВВ     ",   \
  "     ПРВВ1      ",   \
  "     ПРВВ2      ",   \
  "  Зовн.НКН ДЗР  ",   \
  " Збр.Блк.ДЗР1 I3",   \
  " Збр.Блк.ДЗР1 IP",   \
  "    Блок.ДЗР1   ",   \
  "  ПО IР<Iп ДЗР  ",   \
  "ПО IР3/IР1 ДЗР  ",   \
  "Блк.ДЗР1 IР3/IР1",   \
  "Блк.ДЗР1 по IРез",   \
  "    НКН ДЗР     ",   \
  "   СНКН ДЗР     ",   \
  "ПО ДЗР UР<Uп ДЗР",   \
  " ПО2 IБлк.ДЗР1  ",   \
  " Блокув.   ДЗР1 ",   \
  "     ПО ДЗР1    ",   \
  "      ДЗР1      ",   \
  "  ПО АМСЗ ДЗР1  ",   \
  "    АМСЗ ДЗР1   ",   \
  "  Блок.пр.ДЗР2  ",   \
  "   Оп.пр.ДЗР2   ",   \
  " Збр.Блк.ДЗР2 I3",   \
  "    Блок.ДЗ2    ",   \
  "Блк.ДЗР2 IР3/IР1",   \
  " Блокув.   ДЗР2 ",   \
  "  Сект.ДЗР2 Пр. ",   \
  " Сект.ДЗР2 Зв.  ",   \
  "   ПО ДЗР2 Пр.  ",   \
  "  ПО ДЗР2 Зв.   ",   \
  "      ДЗР2      ",   \
  "    АМСЗ ДЗР2   ",   \
  "  ПО АМСЗ ДЗР2  ",   \
  "  Блок.пр.ДЗР3  ",   \
  "   Оп.пр.ДЗР3   ",   \
  " Збр.Блк.ДЗР3 I3",   \
  "    Блок.ДЗР3   ",   \
  "Блк.ДЗР3 IР3/IР1",   \
  " Блокув.   ДЗР3 ",   \
  "  Сект.ДЗР3 Пр. ",   \
  " Сект.ДЗР3 Зв.  ",   \
  "   ПО ДЗР3 Пр.  ",   \
  "  ПО ДЗР3 Зв.   ",   \
  "      ДЗР3      ",   \
  "    АМСЗ ДЗР3   ",   \
  "  ПО АМСЗ ДЗР3  ",   \
  "  Блок.ЗНмін1   ",   \
  "  Пуск ЗНмін1   ",   \
  "  Блок.ЗНмін2   ",   \
  "  Пуск ЗНмін2   ",   \
  "   ПО ЗНмін1    ",   \
  " ПО Uблк.ЗНмін1 ",   \
  " ПО Iблк.ЗНмін1 ",   \
  "     ЗНмін1     ",   \
  "     ПО ЗНмін2  ",   \
  " ПО Uблк.ЗНмін2 ",   \
  " ПО Iблк.ЗНмін2 ",   \
  "     ЗНмін2     ",   \
  "  Блок.ЗНмакс1  ",   \
  "   ПО ЗНмакс1   ",   \
  "    ЗНмакс1     ",   \
  "  Блок.ЗНмакс2  ",   \
  "   ПО ЗНмакс2   ",   \
  "    ЗНмакс2     ",   \
  "    Блок.УЗx    ",   \
  "     ПО УЗx     ",   \
  "      УЗx       ",   \
  " Вх.В-функції1  ",   \
  " Ск.В-функції1  ",   \
  " Вих.В-функції1 ",   \
  " Вх.В-функції2  ",   \
  " Ск.В-функції2  ",   \
  " Вих.В-функції2 ",   \
  " Вх.В-функції3  ",   \
  " Ск.В-функції3  ",   \
  " Вих.В-функції3 ",   \
  " Вх.В-функції4  ",   \
  " Ск.В-функції4  ",   \
  " Вих.В-функції4 ",   \
  " Вх.В-функції5  ",   \
  " Ск.В-функції5  ",   \
  " Вих.В-функції5 ",   \
  " Вх.В-функції6  ",   \
  " Ск.В-функції6  ",   \
  " Вих.В-функції6 ",   \
  " Вх.В-функції7  ",   \
  " Ск.В-функції7  ",   \
  " Вих.В-функції7 ",   \
  " Вх.В-функції8  ",   \
  " Ск.В-функції8  ",   \
  " Вих.В-функції8 ",   \
  " Вх.В-функції9  ",   \
  " Ск.В-функції9  ",   \
  " Вих.В-функції9 ",   \
  " Вх.В-функції10 ",   \
  " Ск.В-функції10 ",   \
  " Вих.В-функції10",   \
  " Вх.В-функції11 ",   \
  " Ск.В-функції11 ",   \
  " Вих.В-функції11",   \
  " Вх.В-функції12 ",   \
  " Ск.В-функції12 ",   \
  " Вих.В-функції12",   \
  " Вх.В-функції13 ",   \
  " Ск.В-функції13 ",   \
  " Вих.В-функції13",   \
  " Вх.В-функції14 ",   \
  " Ск.В-функції14 ",   \
  " Вих.В-функції14",   \
  " Вх.В-функції15 ",   \
  " Ск.В-функції15 ",   \
  " Вих.В-функції15",   \
  " Вх.В-функції16 ",   \
  " Ск.В-функції16 ",   \
  " Вих.В-функції16",   \
  " Вст.В-триґера1 ",   \
  " Ск.В-триґера1  ",   \
  " Вих.В-триґера1 ",   \
  " Вст.В-триґера2 ",   \
  " Ск.В-триґера2  ",   \
  " Вих.В-триґера2 ",   \
  " Вст.В-триґера3 ",   \
  " Ск.В-триґера3  ",   \
  " Вих.В-триґера3 ",   \
  " Вст.В-триґера4 ",   \
  " Ск.В-триґера4  ",   \
  " Вих.В-триґера4 ",   \
  "      В-І1      ",   \
  "      В-І2      ",   \
  "      В-І3      ",   \
  "      В-І4      ",   \
  "      В-І5      ",   \
  "      В-І6      ",   \
  "      В-І7      ",   \
  "      В-І8      ",   \
  "     В-АБО1     ",   \
  "     В-АБО2     ",   \
  "     В-АБО3     ",   \
  "     В-АБО4     ",   \
  "     В-АБО5     ",   \
  "     В-АБО6     ",   \
  "     В-АБО7     ",   \
  "     В-АБО8     ",   \
  "  В-Викл.АБО1   ",   \
  "  В-Викл.АБО2   ",   \
  "  В-Викл.АБО3   ",   \
  "  В-Викл.АБО4   ",   \
  "  В-Викл.АБО5   ",   \
  "  В-Викл.АБО6   ",   \
  "  В-Викл.АБО7   ",   \
  "  В-Викл.АБО8   ",   \
  "     В-НЕ1      ",   \
  "     В-НЕ2      ",   \
  "     В-НЕ3      ",   \
  "     В-НЕ4      ",   \
  "     В-НЕ5      ",   \
  "     В-НЕ6      ",   \
  "     В-НЕ7      ",   \
  "     В-НЕ8      ",   \
  "     В-НЕ9      ",   \
  "     В-НЕ10     ",   \
  "     В-НЕ11     ",   \
  "     В-НЕ12     ",   \
  "     В-НЕ13     ",   \
  "     В-НЕ14     ",   \
  "     В-НЕ15     ",   \
  "     В-НЕ16     ",   \
  "      ФЗ1       ",   \
  "      ФЗ2       ",   \
  "      ФЗ3       ",   \
  "      ФЗ4       ",   \
  "      ФЗ5       ",   \
  "      ФЗ6       ",   \
  "      ФЗ7       ",   \
  "      ФЗ8       ",   \
  "      ФЗ9       ",   \
  "      ФЗ10      ",   \
  "      ФЗ11      ",   \
  "      ФЗ12      ",   \
  "      ФЗ13      ",   \
  "      ФЗ14      ",   \
  "      ФЗ15      ",   \
  "      ФЗ16      ",   \
  " Пом.нал.р.лог. "
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//!~~~$                                          UA END NAMES         ~~~~~
//!~~~$                                          UA END NAMES         ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
  
#endif //NAME_RANG_A01_UA_ 
#ifndef NAME_RANG_A01_EN_ 
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//!~~~@     EN BEGIN  NAMES             ~~~~
//!~~~@     EN BEGIN  NAMES             ~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//`````````````````````````````````````````````````````````````````````````````````` 

#define NAME_RANG_A01_EN    \
  " ON CBM Blocking",   \
  " ON CBR Blocking",   \
  "Indication Reset",   \
  "  Relay Reset   ",   \
  "  Local/Remote  ",   \
  "  State of CBM  ",   \
  "  State of CBR  ",   \
  "     On CBM     ",   \
  "     On CBR     ",   \
  " On CBM Control ",   \
  " On CBR Control ",   \
  "     Off CBM    ",   \
  "     Off CBR    ",   \
  " Off CBM Control",   \
  " Off CBR Control",   \
  "  CBM Actuator  ",   \
  "  CBR Actuator  ",   \
  "E   НЦНО        ",   \
  "E   НЦНР        ",   \
  "EПрев.Iот.ном.  ",   \
  "EКрит.Ресурс ВВ ",   \
  "EИсч.Ресурс ВВ  ",   \
  "  Total Fault   ",   \
  " Emergence Fault",   \
  "An.Rec.Operation",   \
  " D.Rec.Operation",   \
  "EОткл.от защ.ВВО",   \
  "EОткл.от защ.ВВР",   \
  "Off CBM Operate ",   \
  "Off CBR Operate ",   \
  " On CBM Operate ",   \
  " On CBR Operate ",   \
  " Pick-up Set 1  ",   \
  " Pick-up Set 2  ",   \
  " Pick-up Set 3  ",   \
  " Pick-up Set 4  ",   \
  "EИнв.ДВ гр.уст. ",   \
  "Eлк.гр.уст.от з.",   \
  "EС.блк.Гот.к ТУ ",   \
  "EГотовность к ТУ",   \
  "Changed settings",   \
  "E  Вн.НЦН ДЗО   ",   \
  "Eапр.Блк.ДЗО1 I3",   \
  "Eапр.Блк.ДЗО1 IO",   \
  "E   Блок.ДЗО1   ",   \
  "EО Iо<0.5A ДЗО1 ",   \
  "EО Iо3/Io1 ДЗО  ",   \
  "Eлк.ДЗО1 Iо3/Io1",   \
  "Eлк.ДЗО1 по Iосн",   \
  "E   НЦН ДЗО     ",   \
  "E  СНЦН ДЗО     ",   \
  "EО ДЗО Uo<0.25Un",   \
  "EПО2 IБлк.ДЗО1  ",   \
  "EБлокир.   ДЗО1 ",   \
  "E    ПО ДЗО1    ",   \
  "E     ДЗО1      ",   \
  "E ПО АМТЗ ДЗО1  ",   \
  "E   АМТЗ ДЗО1   ",   \
  "E Блок.уск.ДЗО2 ",   \
  "E  Оп.уск.ДЗО2  ",   \
  "Eапр.Блк.ДЗО2 I3",   \
  "E   Блок.ДЗ2    ",   \
  "Eлк.ДЗО2 Iо3/Io1",   \
  "EБлокир.   ДЗО2 ",   \
  "E Сект.ДЗО2 Пр. ",   \
  "EСект.ДЗО2 Обр. ",   \
  "E  ПО ДЗО2 Пр.  ",   \
  "E ПО ДЗО2 Обр.  ",   \
  "E     ДЗО2      ",   \
  "E   АМТЗ ДЗО2   ",   \
  "E ПО АМТЗ ДЗО2  ",   \
  "E Блок.уск.ДЗО3 ",   \
  "E  Оп.уск.ДЗО3  ",   \
  "Eапр.Блк.ДЗО3 I3",   \
  "E   Блок.ДЗО3   ",   \
  "Eлк.ДЗО3 Iо3/Io1",   \
  "EБлокир.   ДЗО3 ",   \
  "E Сект.ДЗО3 Пр. ",   \
  "EСект.ДЗО3 Обр. ",   \
  "E  ПО ДЗО3 Пр.  ",   \
  "E ПО ДЗО3 Обр.  ",   \
  "E     ДЗО3      ",   \
  "E   АМТЗ ДЗО3   ",   \
  "E ПО АМТЗ ДЗО3  ",   \
  "Eапр.Блк.ДЗО4 I3",   \
  "E   Блок.ДЗО4   ",   \
  "Eлк.ДЗО4 Iо3/Io1",   \
  "EБлокир.   ДЗО4 ",   \
  "E Напр.ДЗО4 Пр. ",   \
  "EНапр.ДЗО4 Обр. ",   \
  "E  ПО ДЗО4 Пр.  ",   \
  "E ПО ДЗО4 Обр.  ",   \
  "E     ДЗО4      ",   \
  "E   АМТЗ ДЗО4   ",   \
  "E ПО АМТЗ ДЗО4  ",   \
  "E   Блок.ЗДЗ    ",   \
  "EПуск ЗДЗ от ДВ ",   \
  "EСвет ЗДЗ от ДВ ",   \
  "Eвет ЗДЗ от ОВД1",   \
  "Eвет ЗДЗ от ОВД2",   \
  "Eвет ЗДЗ от ОВД3",   \
  "E    ПО ЗДЗ     ",   \
  "E     ЗДЗ       ",   \
  "E   НЦН-МТЗО    ",   \
  "EПО блок.U МТЗО ",   \
  "E  Блок.МТЗО1   ",   \
  "EПО U МТЗОПН1   ",   \
  "Eект.МТЗОН1 Пр. ",   \
  "Eект.МТЗОН1 Обр.",   \
  "E  ПО МТЗО1     ",   \
  "EО МТЗОН1 Прямой",   \
  "EО МТЗОН1 Обр.  ",   \
  "E ПО МТЗОПН1    ",   \
  "E    МТЗО1      ",   \
  "E  Блок.МТЗО2   ",   \
  "EБлок.уск.МТЗО2 ",   \
  "EПО U МТЗОПН2   ",   \
  "Eект.МТЗОН2 Пр. ",   \
  "Eект.МТЗОН2 Обр.",   \
  "E  ПО МТЗО2     ",   \
  "EО МТЗОН2 Прямой",   \
  "EО МТЗОН2 Обр.  ",   \
  "E ПО МТЗОПН2    ",   \
  "E    МТЗО2      ",   \
  "E  Блок.МТЗО3   ",   \
  "EПО U МТЗОПН3   ",   \
  "Eект.МТЗОН3 Пр. ",   \
  "Eект.МТЗОН3 Обр.",   \
  "E  ПО МТЗО3     ",   \
  "EО МТЗОН3 Прямой",   \
  "EО МТЗОН3 Обр.  ",   \
  "E ПО МТЗОПН3    ",   \
  "E    МТЗО3      ",   \
  "E  Блок.МТЗО4   ",   \
  "EПО U МТЗОПН4   ",   \
  "Eект.МТЗОН4 Пр. ",   \
  "Eект.МТЗОН4 Обр.",   \
  "E  ПО МТЗО4     ",   \
  "EО МТЗОН4 Прямой",   \
  "EО МТЗОН4 Обр.  ",   \
  "E ПО МТЗОПН4    ",   \
  "E    МТЗО4      ",   \
  "E   НЦН-МТЗР    ",   \
  "EПО блок.U МТЗР ",   \
  "E  Блок.МТЗР1   ",   \
  "EПО U МТЗРПН1   ",   \
  "Eект.МТЗРН1 Пр. ",   \
  "Eект.МТЗРН1 Обр.",   \
  "E  ПО МТЗР1     ",   \
  "EО МТЗРН1 Прямой",   \
  "EО МТЗРН1 Обр.  ",   \
  "E ПО МТЗРПН1    ",   \
  "E    МТЗР1      ",   \
  "E  Блок.МТЗР2   ",   \
  "EПО U МТЗРПН2   ",   \
  "Eект.МТЗРН2 Пр. ",   \
  "Eект.МТЗРН2 Обр.",   \
  "E  ПО МТЗР2     ",   \
  "EО МТЗРН2 Прямой",   \
  "EО МТЗРН2 Обр.  ",   \
  "E ПО МТЗРПН2    ",   \
  "E    МТЗР2      ",   \
  "Static Blc.of AR",   \
  "       AR       ",   \
  "      AR2       ",   \
  "      AR3       ",   \
  "      AR4       ",   \
  "   Работа АПВ   ",   \
  "UFLS/FAR from DI",   \
  "E  Блок.АЧР1    ",   \
  "E  Блок.АЧР2    ",   \
  "E  Разр.ЧАПВ    ",   \
  "E  Блок.ЧАПВ    ",   \
  "E   ПО АЧР1     ",   \
  "E  ПО ЧАПВ1     ",   \
  "E  UFLS/FAR1    ",   \
  "E   ПО АЧР2     ",   \
  "E  ПО ЧАПВ2     ",   \
  "E  UFLS/FAR2    ",   \
  " CBFP Start f.DI",   \
  "    CBFP SE     ",   \
  "     CBFP1      ",   \
  "     CBFP2      ",   \
  "E  Вн.НЦН ДЗР   ",   \
  "Eапр.Блк.ДЗР1 I3",   \
  "Eапр.Блк.ДЗР1 Iр",   \
  "E   Блок.ДЗР1   ",   \
  "EО Iр<0.5A ДЗР  ",   \
  "EО Iр3/Iр1 ДЗР  ",   \
  "Eлк.ДЗР1 Iр3/Iр1",   \
  "Eлк.ДЗР1 по Iрез",   \
  "E   НЦН ДЗР     ",   \
  "E  СНЦН ДЗР     ",   \
  "EО ДЗР Uр<0.25Un",   \
  "EПО2 IБлк.ДЗР1  ",   \
  "EБлокир.   ДЗР1 ",   \
  "E    ПО ДЗР1    ",   \
  "E     ДЗР1      ",   \
  "E ПО АМТЗ ДЗР1  ",   \
  "E   АМТЗ ДЗР1   ",   \
  "E Блок.уск.ДЗР2 ",   \
  "E  Оп.уск.ДЗР2  ",   \
  "Eапр.Блк.ДЗР2 I3",   \
  "E   Блок.ДЗ2    ",   \
  "Eлк.ДЗР2 Iр3/Iр1",   \
  "EБлокир.   ДЗР2 ",   \
  "E Сект.ДЗР2 Пр. ",   \
  "EСект.ДЗР2 Обр. ",   \
  "E  ПО ДЗР2 Пр.  ",   \
  "E ПО ДЗР2 Обр.  ",   \
  "E     ДЗР2      ",   \
  "E   АМТЗ ДЗР2   ",   \
  "E ПО АМТЗ ДЗР2  ",   \
  "E Блок.уск.ДЗР3 ",   \
  "E  Оп.уск.ДЗР3  ",   \
  "Eапр.Блк.ДЗР3 I3",   \
  "E   Блок.ДЗР3   ",   \
  "Eлк.ДЗР3 Iр3/Iр1",   \
  "EБлокир.   ДЗР3 ",   \
  "E Сект.ДЗР3 Пр. ",   \
  "EСект.ДЗР3 Обр. ",   \
  "E  ПО ДЗР3 Пр.  ",   \
  "E ПО ДЗР3 Обр.  ",   \
  "E     ДЗР3      ",   \
  "E   АМТЗ ДЗР3   ",   \
  "E ПО АМТЗ ДЗР3  ",   \
  "E  Блок.Umin1   ",   \
  "E  Пуск Umin1   ",   \
  "E  Блок.Umin2   ",   \
  "E  Пуск Umin2   ",   \
  "E   ПО Umin1    ",   \
  "EПО Uблк.Umin1  ",   \
  "EПО Iблк.Umin1  ",   \
  "E    Umin1      ",   \
  "E   ПО Umin2    ",   \
  "EПО Uблк.Umin2  ",   \
  "EПО Iблк.Umin2  ",   \
  "E    Umin2      ",   \
  "E  Блок.Umax1   ",   \
  "E   ПО Umax1    ",   \
  "E    Umax1      ",   \
  "E  Блок.Umax2   ",   \
  "E   ПО Umax2    ",   \
  "E    Umax2      ",   \
  "   MFPx Block   ",   \
  "   MFPx Start   ",   \
  "      MFPx      ",   \
  "    UDF1 In     ",   \
  "    UDF1 R      ",   \
  "    UDF1 Out    ",   \
  "    UDF2 In     ",   \
  "    UDF2 R      ",   \
  "    UDF2 Out    ",   \
  "    UDF3 In     ",   \
  "    UDF3 R      ",   \
  "    UDF3 Out    ",   \
  "    UDF4 In     ",   \
  "    UDF4 R      ",   \
  "    UDF4 Out    ",   \
  "    UDF5 In     ",   \
  "    UDF5 R      ",   \
  "    UDF5 Out    ",   \
  "    UDF6 In     ",   \
  "    UDF6 R      ",   \
  "    UDF6 Out    ",   \
  "    UDF7 In     ",   \
  "    UDF7 R      ",   \
  "    UDF7 Out    ",   \
  "    UDF8 In     ",   \
  "    UDF8 R      ",   \
  "    UDF8 Out    ",   \
  "    UDF9 In     ",   \
  "    UDF9 R      ",   \
  "    UDF9 Out    ",   \
  "    UDF10 In    ",   \
  "    UDF10 R     ",   \
  "    UDF10 Out   ",   \
  "    UDF11 In    ",   \
  "    UDF11 R     ",   \
  "    UDF11 Out   ",   \
  "    UDF12 In    ",   \
  "    UDF12 R     ",   \
  "    UDF12 Out   ",   \
  "    UDF13 In    ",   \
  "    UDF13 R     ",   \
  "    UDF13 Out   ",   \
  "    UDF14 In    ",   \
  "    UDF14 R     ",   \
  "    UDF14 Out   ",   \
  "    UDF15 In    ",   \
  "    UDF15 R     ",   \
  "    UDF15 Out   ",   \
  "    UDF16 In    ",   \
  "    UDF16 R     ",   \
  "    UDF16 Out   ",   \
  "UD Flip-Flop1 S.",   \
  "UD Flip-Flop1 R.",   \
  "UD Flip-Flop1 O.",   \
  "UD Flip-Flop2 S.",   \
  "UD Flip-Flop2 R.",   \
  "UD Flip-Flop2 O.",   \
  "UD Flip-Flop3 S.",   \
  "UD Flip-Flop3 R.",   \
  "UD Flip-Flop3 O.",   \
  "UD Flip-Flop4 S.",   \
  "UD Flip-Flop4 R.",   \
  "UD Flip-Flop4 O.",   \
  "    UD AND1     ",   \
  "    UD AND2     ",   \
  "    UD AND3     ",   \
  "    UD AND4     ",   \
  "    UD AND5     ",   \
  "    UD AND6     ",   \
  "    UD AND7     ",   \
  "    UD AND8     ",   \
  "     UD OR1     ",   \
  "     UD OR2     ",   \
  "     UD OR3     ",   \
  "     UD OR4     ",   \
  "     UD OR5     ",   \
  "     UD OR6     ",   \
  "     UD OR7     ",   \
  "     UD OR8     ",   \
  "    UD XOR1     ",   \
  "    UD XOR2     ",   \
  "    UD XOR3     ",   \
  "    UD XOR4     ",   \
  "    UD XOR5     ",   \
  "    UD XOR6     ",   \
  "    UD XOR7     ",   \
  "    UD XOR8     ",   \
  "    UD NOT1     ",   \
  "    UD NOT2     ",   \
  "    UD NOT3     ",   \
  "    UD NOT4     ",   \
  "    UD NOT5     ",   \
  "    UD NOT6     ",   \
  "    UD NOT7     ",   \
  "    UD NOT8     ",   \
  "    UD NOT9     ",   \
  "    UD NOT10    ",   \
  "    UD NOT11    ",   \
  "    UD NOT12    ",   \
  "    UD NOT13    ",   \
  "    UD NOT14    ",   \
  "    UD NOT15    ",   \
  "    UD NOT16    ",   \
  "      СF1       ",   \
  "      СF2       ",   \
  "      СF3       ",   \
  "      СF4       ",   \
  "      СF5       ",   \
  "      СF6       ",   \
  "      СF7       ",   \
  "      СF8       ",   \
  "      СF9       ",   \
  "      СF10      ",   \
  "      СF11      ",   \
  "      СF12      ",   \
  "      СF13      ",   \
  "      СF14      ",   \
  "      СF15      ",   \
  "      СF16      ",   \
  " Ош.настр.р.лог."
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//!~~~$                                          EN END NAMES         ~~~~~
//!~~~$                                          EN END NAMES         ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
  
#endif //NAME_RANG_A01_EN_  
#ifndef NAME_RANG_A01_KZ_
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//!~~~@     KZ BEGIN  NAMES             ~~~~
//!~~~@     KZ BEGIN  NAMES             ~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//`````````````````````````````````````````````````````````````````````````````````` 

#define NAME_RANG_A01_KZ  \
  "K Блок.вкл.ВВО  ",   \
  "K Блок.вкл.ВВР  ",   \
  "KСброс индикации",   \
  "K  Сброс реле   ",   \
  "KМестн./Дистанц.",   \
  "K Положение ВВР ",   \
  "K Положение ВВО ",   \
  "K    Вкл.ВВО    ",   \
  "K    Вкл.ВВР    ",   \
  "Kонтр.  Вкл.ВВО ",   \
  "Kонтр.  Вкл.ВВР ",   \
  "K   Откл.ВВО    ",   \
  "K   Откл.ВВР    ",   \
  "Kонтрол.Откл.ВВО",   \
  "Kонтрол.Откл.ВВР",   \
  "K  Привод ВВО   ",   \
  "K  Привод ВВР   ",   \
  "K   НЦНО        ",   \
  "K   НЦНР        ",   \
  "KПрев.Iот.ном.  ",   \
  "KКрит.Ресурс ВВО",   \
  "KИсч.Ресурс ВВО ",   \
  "K Неиспр.Общая  ",   \
  "K Неиспр.Авар.  ",   \
  "KРабота Ан.Рег. ",   \
  "KРабота Д.Рег.  ",   \
  "KОткл.от защ.ВВО",   \
  "KОткл.от защ.ВВР",   \
  "K      БО ВО    ",   \
  "K      БО ВР    ",   \
  "K      БВ ВО    ",   \
  "K      БВ ВР    ",   \
  "K1-я гр.уставок ",   \
  "K2-я гр.уставок ",   \
  "K3-я гр.уставок ",   \
  "K4-я гр.уставок ",   \
  "KИнв.ДВ гр.уст. ",   \
  "Kлк.гр.уст.от з.",   \
  "KС.блк.Гот.к ТУ ",   \
  "KГотовность к ТУ",   \
  "K Изм.настроек  ",   \
  "K  Вн.НЦН ДЗО   ",   \
  "Kапр.Блк.ДЗО1 I3",   \
  "Kапр.Блк.ДЗО1 IО",   \
  "K   Блок.ДЗО1   ",   \
  "K ПО IО<Iп ДЗО  ",   \
  "KО IО3/IО1 ДЗО  ",   \
  "Kлк.ДЗО1 IО3/IО1",   \
  "Kлк.ДЗО1 по IОсн",   \
  "K   НЦН ДЗО     ",   \
  "K  СНЦН ДЗО     ",   \
  "K ПО ДЗО UО<Uп  ",   \
  "KПО2 IБлк.ДЗО1  ",   \
  "KБлокир.   ДЗО1 ",   \
  "K    ПО ДЗО1    ",   \
  "K     ДЗО1      ",   \
  "K ПО АМТЗ ДЗО1  ",   \
  "K   АМТЗ ДЗО1   ",   \
  "K Блок.уск.ДЗО2 ",   \
  "K  Оп.уск.ДЗО2  ",   \
  "Kапр.Блк.ДЗО2 I3",   \
  "K   Блок.ДЗ2    ",   \
  "Kлк.ДЗО2 IО3/IО1",   \
  "KБлокир.   ДЗО2 ",   \
  "K Сект.ДЗО2 Пр. ",   \
  "KСект.ДЗО2 Обр. ",   \
  "K  ПО ДЗО2 Пр.  ",   \
  "K ПО ДЗО2 Обр.  ",   \
  "K     ДЗО2      ",   \
  "K   АМТЗ ДЗО2   ",   \
  "K ПО АМТЗ ДЗО2  ",   \
  "K Блок.уск.ДЗО3 ",   \
  "K  Оп.уск.ДЗО3  ",   \
  "Kапр.Блк.ДЗО3 I3",   \
  "K   Блок.ДЗО3   ",   \
  "Kлк.ДЗО3 IО3/IО1",   \
  "KБлокир.   ДЗО3 ",   \
  "K Сект.ДЗО3 Пр. ",   \
  "KСект.ДЗО3 Обр. ",   \
  "K  ПО ДЗО3 Пр.  ",   \
  "K ПО ДЗО3 Обр.  ",   \
  "K     ДЗО3      ",   \
  "K   АМТЗ ДЗО3   ",   \
  "K ПО АМТЗ ДЗО3  ",   \
  "Kапр.Блк.ДЗО4 I3",   \
  "K   Блок.ДЗО4   ",   \
  "Kлк.ДЗО4 IО3/IО1",   \
  "KБлокир.   ДЗО4 ",   \
  "K Напр.ДЗО4 Пр. ",   \
  "KНапр.ДЗО4 Обр. ",   \
  "K  ПО ДЗО4 Пр.  ",   \
  "K ПО ДЗО4 Обр.  ",   \
  "K     ДЗО4      ",   \
  "K   АМТЗ ДЗО4   ",   \
  "K ПО АМТЗ ДЗО4  ",   \
  "K   Блок.ЗДЗ    ",   \
  "KПуск ЗДЗ от ДВ ",   \
  "KСвет ЗДЗ от ДВ ",   \
  "Kвет ЗДЗ от ОВД1",   \
  "Kвет ЗДЗ от ОВД2",   \
  "Kвет ЗДЗ от ОВД3",   \
  "K    ПО ЗДЗ     ",   \
  "K     ЗДЗ       ",   \
  "K   НЦН-МТЗО    ",   \
  "KПО блок.U МТЗО ",   \
  "K  Блок.МТЗО1   ",   \
  "KПО U МТЗОПН1   ",   \
  "Kект.МТЗОН1 Пр. ",   \
  "Kект.МТЗОН1 Обр.",   \
  "K  ПО МТЗО1     ",   \
  "KО МТЗОН1 Прямой",   \
  "KО МТЗОН1 Обр.  ",   \
  "K ПО МТЗОПН1    ",   \
  "K    МТЗО1      ",   \
  "K  Блок.МТЗО2   ",   \
  "KБлок.уск.МТЗО2 ",   \
  "KПО U МТЗОПН2   ",   \
  "Kект.МТЗОН2 Пр. ",   \
  "Kект.МТЗОН2 Обр.",   \
  "K  ПО МТЗО2     ",   \
  "KО МТЗОН2 Прямой",   \
  "KО МТЗОН2 Обр.  ",   \
  "K ПО МТЗОПН2    ",   \
  "K    МТЗО2      ",   \
  "K  Блок.МТЗО3   ",   \
  "KПО U МТЗОПН3   ",   \
  "Kект.МТЗОН3 Пр. ",   \
  "Kект.МТЗОН3 Обр.",   \
  "K  ПО МТЗО3     ",   \
  "KО МТЗОН3 Прямой",   \
  "KО МТЗОН3 Обр.  ",   \
  "K ПО МТЗОПН3    ",   \
  "K    МТЗО3      ",   \
  "K  Блок.МТЗО4   ",   \
  "KПО U МТЗОПН4   ",   \
  "Kект.МТЗОН4 Пр. ",   \
  "Kект.МТЗОН4 Обр.",   \
  "K  ПО МТЗО4     ",   \
  "KО МТЗОН4 Прямой",   \
  "KО МТЗОН4 Обр.  ",   \
  "K ПО МТЗОПН4    ",   \
  "K    МТЗО4      ",   \
  "K   НЦН-МТЗР    ",   \
  "KПО блок.U МТЗР ",   \
  "K  Блок.МТЗР1   ",   \
  "KПО U МТЗРПН1   ",   \
  "Kект.МТЗРН1 Пр. ",   \
  "Kект.МТЗРН1 Обр.",   \
  "K  ПО МТЗР1     ",   \
  "KО МТЗРН1 Прямой",   \
  "KО МТЗРН1 Обр.  ",   \
  "K ПО МТЗРПН1    ",   \
  "K    МТЗР1      ",   \
  "K  Блок.МТЗР2   ",   \
  "KПО U МТЗРПН2   ",   \
  "Kект.МТЗРН2 Пр. ",   \
  "Kект.МТЗРН2 Обр.",   \
  "K  ПО МТЗР2     ",   \
  "KО МТЗРН2 Прямой",   \
  "KО МТЗРН2 Обр.  ",   \
  "K ПО МТЗРПН2    ",   \
  "K    МТЗР2      ",   \
  "KСтат.блок.АПВ  ",   \
  "K     АПВ       ",   \
  "K     АПВ2      ",   \
  "K     АПВ3      ",   \
  "K     АПВ4      ",   \
  "K  Работа АПВ   ",   \
  "KАЧР/ЧАПВ от ДВ ",   \
  "K  Блок.АЧР1    ",   \
  "K  Блок.АЧР2    ",   \
  "K  Разр.ЧАПВ    ",   \
  "K Блок.ЧАПВ от U",   \
  "K   ПО АЧР1     ",   \
  "K   ПО ЧАПВ1    ",   \
  "K  АЧР/ЧАПВ1    ",   \
  "K   ПО АЧР2     ",   \
  "K   ПО ЧАПВ2    ",   \
  "K  АЧР/ЧАПВ2    ",   \
  "KПуск УРОВ от ДВ",   \
  "K   ПО УРОВ     ",   \
  "K    УРОВ1      ",   \
  "K    УРОВ2      ",   \
  "K  Вн.НЦН ДЗР   ",   \
  "Kапр.Блк.ДЗР1 I3",   \
  "Kапр.Блк.ДЗР1 IP",   \
  "K   Блок.ДЗР1   ",   \
  "K ПО IР<Iп ДЗР  ",   \
  "KО IР3/IР1 ДЗР  ",   \
  "Kлк.ДЗР1 IР3/IР1",   \
  "Kлк.ДЗР1 по IРез",   \
  "K   НЦН ДЗР     ",   \
  "K  СНЦН ДЗР     ",   \
  "KО ДЗР UР<Uп ДЗР",   \
  "KПО2 IБлк.ДЗР1  ",   \
  "KБлокир.   ДЗР1 ",   \
  "K    ПО ДЗР1    ",   \
  "K     ДЗР1      ",   \
  "K ПО АМТЗ ДЗР1  ",   \
  "K   АМТЗ ДЗР1   ",   \
  "K Блок.уск.ДЗР2 ",   \
  "K  Оп.уск.ДЗР2  ",   \
  "Kапр.Блк.ДЗР2 I3",   \
  "K   Блок.ДЗ2    ",   \
  "Kлк.ДЗР2 IР3/IР1",   \
  "KБлокир.   ДЗР2 ",   \
  "K Сект.ДЗР2 Пр. ",   \
  "KСект.ДЗР2 Обр. ",   \
  "K  ПО ДЗР2 Пр.  ",   \
  "K ПО ДЗР2 Обр.  ",   \
  "K     ДЗР2      ",   \
  "K   АМТЗ ДЗР2   ",   \
  "K ПО АМТЗ ДЗР2  ",   \
  "K Блок.уск.ДЗР3 ",   \
  "K  Оп.уск.ДЗР3  ",   \
  "Kапр.Блк.ДЗР3 I3",   \
  "K   Блок.ДЗР3   ",   \
  "Kлк.ДЗР3 IР3/IР1",   \
  "KБлокир.   ДЗР3 ",   \
  "K Сект.ДЗР3 Пр. ",   \
  "KСект.ДЗР3 Обр. ",   \
  "K  ПО ДЗР3 Пр.  ",   \
  "K ПО ДЗР3 Обр.  ",   \
  "K     ДЗР3      ",   \
  "K   АМТЗ ДЗР3   ",   \
  "K ПО АМТЗ ДЗР3  ",   \
  "K Блок.ЗНмин1   ",   \
  "K Пуск ЗНмин1   ",   \
  "K Блок.ЗНмин2   ",   \
  "K Пуск ЗНмин2   ",   \
  "K  ПО ЗНмин1    ",   \
  "KПО Uблк.ЗНмин1 ",   \
  "KПО Iблк.ЗНмин1 ",   \
  "K    ЗНмин1     ",   \
  "K    ПО ЗНмин2  ",   \
  "KПО Uблк.ЗНмин2 ",   \
  "KПО Iблк.ЗНмин2 ",   \
  "K    ЗНмин2     ",   \
  "K Блок.ЗНмакс1  ",   \
  "K  ПО ЗНмакс1   ",   \
  "K   ЗНмакс1     ",   \
  "K Блок.ЗНмакс2  ",   \
  "K  ПО ЗНмакс2   ",   \
  "K   ЗНмакс2     ",   \
  "K   Блок.УЗx    ",   \
  "K    ПО УЗx     ",   \
  "K     УЗx       ",   \
  "KВх.О-функции1  ",   \
  "kСбр.О-функции1 ",   \
  "KВых.О-функции1 ",   \
  "KВх.О-функции2  ",   \
  "kСбр.О-функции2 ",   \
  "KВых.О-функции2 ",   \
  "KВх.О-функции3  ",   \
  "kСбр.О-функции3 ",   \
  "KВых.О-функции3 ",   \
  "KВх.О-функции4  ",   \
  "kСбр.О-функции4 ",   \
  "KВых.О-функции4 ",   \
  "KВх.О-функции5  ",   \
  "kСбр.О-функции5 ",   \
  "KВых.О-функции5 ",   \
  "KВх.О-функции6  ",   \
  "kСбр.О-функции6 ",   \
  "KВых.О-функции6 ",   \
  "KВх.О-функции7  ",   \
  "kСбр.О-функции7 ",   \
  "KВых.О-функции7 ",   \
  "KВх.О-функции8  ",   \
  "kСбр.О-функции8 ",   \
  "KВых.О-функции8 ",   \
  "KВх.О-функции9  ",   \
  "kСбр.О-функции9 ",   \
  "KВых.О-функции9 ",   \
  "KВх.О-функции10 ",   \
  "kСбр.О-функции10",   \
  "KВых.О-функции10",   \
  "KВх.О-функции11 ",   \
  "kСбр.О-функции11",   \
  "KВых.О-функции11",   \
  "KВх.О-функции12 ",   \
  "kСбр.О-функции12",   \
  "KВых.О-функции12",   \
  "KВх.О-функции13 ",   \
  "kСбр.О-функции13",   \
  "KВых.О-функции13",   \
  "KВх.О-функции14 ",   \
  "kСбр.О-функции14",   \
  "KВых.О-функции14",   \
  "KВх.О-функции15 ",   \
  "kСбр.О-функции15",   \
  "KВых.О-функции15",   \
  "KВх.О-функции16 ",   \
  "kСбр.О-функции16",   \
  "KВых.О-функции16",   \
  "KУст.О-триггера1",   \
  "KСбр.О-триггера1",   \
  "KВых.О-триггера1",   \
  "KУст.О-триггера2",   \
  "KСбр.О-триггера2",   \
  "KВых.О-триггера2",   \
  "KУст.О-триггера3",   \
  "KСбр.О-триггера3",   \
  "KВых.О-триггера3",   \
  "KУст.О-триггера4",   \
  "KСбр.О-триггера4",   \
  "KВых.О-триггера4",   \
  "K     О-И1      ",   \
  "K     О-И2      ",   \
  "K     О-И3      ",   \
  "K     О-И4      ",   \
  "K     О-И5      ",   \
  "K     О-И6      ",   \
  "K     О-И7      ",   \
  "K     О-И8      ",   \
  "K    О-ИЛИ1     ",   \
  "K    О-ИЛИ2     ",   \
  "K    О-ИЛИ3     ",   \
  "K    О-ИЛИ4     ",   \
  "K    О-ИЛИ5     ",   \
  "K    О-ИЛИ6     ",   \
  "K    О-ИЛИ7     ",   \
  "K    О-ИЛИ8     ",   \
  "K О-Искл.ИЛИ1   ",   \
  "K О-Искл.ИЛИ2   ",   \
  "K О-Искл.ИЛИ3   ",   \
  "K О-Искл.ИЛИ4   ",   \
  "K О-Искл.ИЛИ5   ",   \
  "K О-Искл.ИЛИ6   ",   \
  "K О-Искл.ИЛИ7   ",   \
  "K О-Искл.ИЛИ8   ",   \
  "K    О-НЕ1      ",   \
  "K    О-НЕ2      ",   \
  "K    О-НЕ3      ",   \
  "K    О-НЕ4      ",   \
  "K    О-НЕ5      ",   \
  "K    О-НЕ6      ",   \
  "K    О-НЕ7      ",   \
  "K    О-НЕ8      ",   \
  "K    О-НЕ9      ",   \
  "K    О-НЕ10     ",   \
  "K    О-НЕ11     ",   \
  "K    О-НЕ12     ",   \
  "K    О-НЕ13     ",   \
  "K    О-НЕ14     ",   \
  "K    О-НЕ15     ",   \
  "K    О-НЕ16     ",   \
  "      ФС1       ",   \
  "      ФС2       ",   \
  "      ФС3       ",   \
  "      ФС4       ",   \
  "      ФС5       ",   \
  "      ФС6       ",   \
  "      ФС7       ",   \
  "      ФС8       ",   \
  "      ФС9       ",   \
  "      ФС10      ",   \
  "      ФС11      ",   \
  "      ФС12      ",   \
  "      ФС13      ",   \
  "      ФС14      ",   \
  "      ФС15      ",   \
  "      ФС16      ",   \
  "KОш.настр.р.лог."
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//!~~~$                                          KZ END NAMES         ~~~~~
//!~~~$                                          KZ END NAMES         ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
  
#endif //NAME_RANG_A01_KZ_

  


    
#endif 
