#include <string.h> 
#include "const_global.h"
#include "mtzo.h"
void mtzo_handler(unsigned int *p_active_functions, unsigned int number_group_stp );
void mtzo2_handler(unsigned int *p_active_functions, unsigned int number_group_stp );
void mtzo134_handler(unsigned int *p_active_functions, unsigned int number_group_stp );
#ifdef DEBUG_CONFIGURATION
    #ifndef DEBUG_MODE_23_07_19 
        #error "VALUES DZ HAVE UNREAL NUMBER"
    #endif
#endif
char glb_ch_id_mtzo = ID_MTZO1;

void mtzo_handler(unsigned int *p_active_functions, unsigned int number_group_stp ){
    glb_ch_id_mtzo = ID_MTZO1;
    mtzo134_handler(p_active_functions,number_group_stp);
    glb_ch_id_mtzo = ID_MTZO3;
    mtzo134_handler(p_active_functions,number_group_stp);
    glb_ch_id_mtzo = ID_MTZO4;
    mtzo134_handler(p_active_functions,number_group_stp);
}

U8_state_wrp mtzo1_stp,mtzo2_stp,mtzo3_stp,mtzo4_stp;

void mtzo134_handler(unsigned int *p_active_functions, unsigned int number_group_stp );
//=====================================================================================================
//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
//                  
//....................................................................................................
//=====================================================================================================
void mtzo134_handler(unsigned int *p_active_functions, unsigned int number_group_stp )//{UNUSED(number_group_stp);UNUSED(p_active_functions);
{
  long lV;unsigned long rU;
   
  register union { 
  struct {
      unsigned int in_mtzo_normal_selector :1;//0
      unsigned int in_mtzo_dir_selector    :1;//1
      unsigned int in_mtzo_stp_u_selector  :1;//2
      unsigned int in_mtzo_on_menu         :1;//3
      unsigned int in_mtzo_rng_big_block   :1;//4
      unsigned int in_mtzo_dir_on_menu     :1;//5
      unsigned int in_mtzo_sector_dir      :1;//6
      unsigned int in_mtzo_sector_inv      :1;//7
      unsigned int in_mtzo_stp_dir         :1;//8
      unsigned int in_mtzo_inv_on_menu     :1;//9
      unsigned int in_mtzo_stp_inv         :1;//10
      unsigned int in_mtzo_rng_big_po_blk_u                :1;//11
      unsigned int in_mtzo_stp_po_blk_u_osn_less_u_porog   :1;//12
      unsigned int in_mtzo_stp_u       :1;//13
      unsigned int in_mtzo_stp_simple  :1;//14
      unsigned int not10_1_b0   :1;//15
      unsigned int not10_1_b7   :1;//16
      unsigned int not8_1_b0    :1;//17
      unsigned int not8_1_b7    :1;//18
      unsigned int not5_1_b7    :1;//19
      unsigned int and6_2_1_b7  :1;//20
      unsigned int or07_2_1_b7  :1;//21
      unsigned int and9_2_1_b7  :1;//22
      unsigned int and11_2_1_b7 :1;//23
      unsigned int and2_1 :1;//24
      unsigned int and2_2 :1;//25
      unsigned int not3_1 :1;//26
      unsigned int not10_1:1;//27
      unsigned int nor5_1 :1;//28
      unsigned int nor5_2 :1;//29
      unsigned int reser2 :1;//30
      unsigned int reser3 :1;//31
      
   } bool_vars;
  long lVl;
 }wrp_mtzo;
  
  
  struct{
      unsigned long po_mtzo_smpl_spt,     po_mtzon_vpered_spt,  po_mtzon_nazad_spt,
       po_u_mtzopn_spt,     po_mtzopn_spt;
  __SETTINGS *p_current_settings_prt;
  }sLV;    
    wrp_mtzo.lVl = 0;
    U8_state_wrp stt_MTZO_And01__2_1,
                 stt_MTZO_Or_02__3_1,
                 stt_MTZO_Not03__1_1,  
                 stt_MTZO_And04__2_1,
                 //stt_MTZO_Not05__1_1,
                 stt_MTZO_And06__2_1,
                 stt_MTZO_Or_07__2_1, 
                 //stt_MTZO_Not08__1_1,
                 stt_MTZO_And09__2_1,
                 //stt_MTZO_Not10__1_1,
                 stt_MTZO_And11__2_1,
                 stt_MTZO_Or_12__4_1,
                 stt_MTZO_And13__3_1,
                 stt_MTZO_And14__6_1, 
                 stt_MTZO_And15__6_1, 
                 stt_MTZO_And16__4_1; 
                // stt_MTZO_Or_17__4_1;
    lV = 0;         
