#include <string.h> 
#include "const_global.h"
#include "mtzr.h"
void mtzr_handler(unsigned int *p_active_functions, unsigned int number_group_stp );
void mtzr2_handler(unsigned int *p_active_functions, unsigned int number_group_stp );
void mtzr134_handler(unsigned int *p_active_functions, unsigned int number_group_stp );
#ifdef DEBUG_CONFIGURATION
    #ifndef DEBUG_MODE_23_07_19 
        #error "VALUES DZ HAVE UNREAL NUMBER"
    #endif
#endif
char glb_ch_id_mtzr = ID_MTZR1;

void mtzr_handler(unsigned int *p_active_functions, unsigned int number_group_stp ){
    glb_ch_id_mtzr = ID_MTZR1;
    mtzr134_handler(p_active_functions,number_group_stp);
//?    mtzr2_handler(p_active_functions,number_group_stp);
//?    glb_ch_id_mtzr = ID_MTZR3;
//?    mtzr134_handler(p_active_functions,number_group_stp);
    glb_ch_id_mtzr = ID_MTZR2;
    mtzr134_handler(p_active_functions,number_group_stp);
    
}

//?U8_state_wrp mtzr1_stp,mtzr2_stp,mtzr3_stp,mtzr4_stp;
U8_state_wrp stt_MTZR_And01__2_1;
void mtzr134_handler(unsigned int *p_active_functions, unsigned int number_group_stp );
//=====================================================================================================
//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
//                  
//....................................................................................................
//=====================================================================================================
void mtzr134_handler(unsigned int *p_active_functions, unsigned int number_group_stp )//{UNUSED(number_group_stp);UNUSED(p_active_functions);
{
  long lV;unsigned long rU;
   
  register union { 
  struct {
      unsigned int b0                       :1;//0
      unsigned int select_mtzr134_directed  :1;//1
      unsigned int b1                       :1;//2
      unsigned int m_mtzr134                :1;//3
      unsigned int dv_block_mtzr134         :1;//4
      unsigned int m_mtzr134_dir            :1;//5
      unsigned int m_mtzr134_sector_dir     :1;//6
      unsigned int m_mtzr134_sector_inv     :1;//7
      unsigned int b8                       :1;//8
      unsigned int m_mtzr134_inv            :1;//9
      unsigned int b10                      :1;//10
      unsigned int b11                      :1;//11
      unsigned int b12                      :1;//12
      unsigned int b13                      :1;//13
      unsigned int b14                      :1;//14
      unsigned int b15                      :1;//15
      unsigned int not10_1_b7              :1;//16
      unsigned int cmd_nkn_mtzr134         :1;//17
      unsigned int not8_1_b7               :1;//18
      unsigned int not5_1_b7               :1;//19
      unsigned int and6_2_1_b7             :1;//20
      unsigned int or07_2_1_b7             :1;//21
      unsigned int and9_2_1_b7             :1;//22
      unsigned int po_mtzr134_u_pn         :1;//23
      unsigned int po_mtzr134_i_pn         :1;//24
      unsigned int po_mtzr134_sector_inv   :1;//25
      unsigned int po_mtzr134_sector_dir   :1;//26
      unsigned int po_mtzr134_inv          :1;//27
      unsigned int po_mtzr134_dir          :1;//28
      unsigned int po_mtzr134_simple       :1;//29
      unsigned int reser2 :1;//30
      unsigned int reser3 :1;//31
      
   } bool_vars;
  long lVl;
 }wrp_mtzr;
  
  
  struct{
      unsigned long po_mtzr_smpl_spt,     po_mtzrn_vpered_spt,  po_mtzrn_nazad_spt,
       po_u_mtzrpn_spt,     po_mtzrpn_spt;
  __SETTINGS *p_current_settings_prt;
  }sLV;    
    wrp_mtzr.lVl = 0;
    U8_state_wrp 
                 stt_MTZR_Or_02__3_1,
                 stt_MTZR_Not03__1_1,  
                 stt_MTZR_And04__2_1,
                 
                 
                 stt_MTZR_OrN_07__2_1, 
                 
                 stt_MTZR_And09__2_1,
                 
                 stt_MTZR_And11__2_1,
                 stt_MTZR_Or_12__4_1,
                 stt_MTZR_And13__3_1,
                 stt_MTZR_And14__6_1, 
                 stt_MTZR_And15__6_1, 
                 stt_MTZR_And16__4_1; 
                
    lV = 0;         
     stt_MTZR_And01__2_1.U8V = lV;
     stt_MTZR_Or_02__3_1.U8V = lV;
     stt_MTZR_Not03__1_1.U8V = lV;
     stt_MTZR_And04__2_1.U8V = lV;


