#ifndef __CONSTANTS_INPUTS__
#define __CONSTANTS_INPUTS__

#define EKRAN_LIST_INPUTS_FOR_RANGUVANNJA        (EKRAN_CONTROL_UP + 1)

#define EKRAN_RANGUVANNJA_INPUT_1                (EKRAN_TRANSFORMATOR_INFO_CONTROL + 1)
#define EKRAN_RANGUVANNJA_INPUT_2                (EKRAN_RANGUVANNJA_INPUT_1 + 1)
#define EKRAN_RANGUVANNJA_INPUT_3                (EKRAN_RANGUVANNJA_INPUT_2 + 1)
#define EKRAN_RANGUVANNJA_INPUT_4                (EKRAN_RANGUVANNJA_INPUT_3 + 1)
#define EKRAN_RANGUVANNJA_INPUT_5                (EKRAN_RANGUVANNJA_INPUT_4 + 1)
#define EKRAN_RANGUVANNJA_INPUT_6                (EKRAN_RANGUVANNJA_INPUT_5 + 1)
#define EKRAN_RANGUVANNJA_INPUT_7                (EKRAN_RANGUVANNJA_INPUT_6 + 1)
#define EKRAN_RANGUVANNJA_INPUT_8                (EKRAN_RANGUVANNJA_INPUT_7 + 1)

#if (                                \
     (MODYFIKACIA_VERSII_PZ == 0) || \
     (MODYFIKACIA_VERSII_PZ == 1) || \
     (MODYFIKACIA_VERSII_PZ == 3)    \
    )

#define EKRAN_RANGUVANNJA_INPUT_9                (EKRAN_RANGUVANNJA_INPUT_8 + 1)
#define EKRAN_RANGUVANNJA_INPUT_10               (EKRAN_RANGUVANNJA_INPUT_9 + 1)
#define EKRAN_RANGUVANNJA_INPUT_11               (EKRAN_RANGUVANNJA_INPUT_10 + 1)
#define EKRAN_RANGUVANNJA_INPUT_12               (EKRAN_RANGUVANNJA_INPUT_11 + 1)
#define EKRAN_RANGUVANNJA_INPUT_13               (EKRAN_RANGUVANNJA_INPUT_12 + 1)
#define EKRAN_RANGUVANNJA_INPUT_14               (EKRAN_RANGUVANNJA_INPUT_13 + 1)
#define EKRAN_RANGUVANNJA_INPUT_15               (EKRAN_RANGUVANNJA_INPUT_14 + 1)
#define EKRAN_RANGUVANNJA_INPUT_16               (EKRAN_RANGUVANNJA_INPUT_15 + 1)

#if (MODYFIKACIA_VERSII_PZ == 0)

#define EKRAN_RANGUVANNJA_INPUT_17               (EKRAN_RANGUVANNJA_INPUT_16 + 1)
#define EKRAN_RANGUVANNJA_INPUT_18               (EKRAN_RANGUVANNJA_INPUT_17 + 1)
#define EKRAN_RANGUVANNJA_INPUT_19               (EKRAN_RANGUVANNJA_INPUT_18 + 1)
#define EKRAN_RANGUVANNJA_INPUT_20               (EKRAN_RANGUVANNJA_INPUT_19 + 1)

#endif

#endif

#if (MODYFIKACIA_VERSII_PZ == 0)

#define EKRAN_RANGUVANNJA_INPUT_LAST             EKRAN_RANGUVANNJA_INPUT_20

#elif (                                 \
       (MODYFIKACIA_VERSII_PZ == 1) ||  \
       (MODYFIKACIA_VERSII_PZ == 3)     \
      )   

#define EKRAN_RANGUVANNJA_INPUT_LAST             EKRAN_RANGUVANNJA_INPUT_16

#else

#define EKRAN_RANGUVANNJA_INPUT_LAST             EKRAN_RANGUVANNJA_INPUT_8

#endif

#define MAX_ROW_LIST_INPUTS_FOR_RANGUVANNJA       NUMBER_INPUTS
//#define MAX_ROW_RANGUVANNJA_INPUT                 NUMBER_TOTAL_SIGNAL_FOR_RANG_SMALL
#define MAX_ROW_RANGUVANNJA_INPUT                 TOTAL_SIGNAL_FOR_RANG_SMALL_A01

#define NAME_RANG_SMALL_RU         \
  "  Блок.вкл.ВВ   ",                   \
  " Сброс индикации",                   \
  "   Сброс реле   ",                   \
  " Местн./Дистанц.",                   \
  "  Положение ВВ  ",                   \
  "Откл.от вн.защит",                   \
  "     Вкл.ВВ     ",                   \
  " Контроль Вкл.  ",                   \
  "    Откл.ВВ     ",                   \
  " Контроль Откл. ",                   \
  " 1-я гр.уставок ",                   \
  " 2-я гр.уставок ",                   \
  " 3-я гр.уставок ",                   \
  " 4-я гр.уставок ",                   \
  " С.блк.Гот.к ТУ ",                   \
  "    Блок.ДЗ1    ",                   \
  "    Блок.ДЗ2    ",                   \
  "  Блок.уск.ДЗ2  ",                   \
  "   Оп.уск.ДЗ2   ",                   \
  "    Блок.ДЗ3    ",                   \
  "  Блок.уск.ДЗ3  ",                   \
  "   Оп.уск.ДЗ3   ",                   \
  "    Блок.ДЗ4    ",                   \
  "  Блок.уск.ДЗ4  ",                   \
  "   Оп.уск.ДЗ4   ",                   \
  "   Вн.НЦН ДЗ    ",                   \
  "   Блок.МТЗ1    ",                   \
  "   Блок.МТЗ2    ",                   \
  " Блок.уск.МТЗ2  ",                   \
  "   Блок.МТЗ3    ",                   \
  "   Блок.МТЗ4    ",                   \
  "    Блок.ЗДЗ    ",                   \
  " Пуск ЗДЗ от ДВ ",                   \
  "    Блок.НЗЗ    ",                   \
  "   Блок.ТЗНП1   ",                   \
  "   Блок.ТЗНП2   ",                   \
  "   Блок.ТЗНП3   ",                   \
  " Стат.блок.АПВ  ",                   \
  " АЧР/ЧАПВ от ДВ ",                   \
  "   Блок.АЧР1    ",                   \
  "   Блок.АЧР2    ",                   \
  " Пуск УРОВ от ДВ",                   \
  " Блок.ЗОП(КОФ)  ",                   \
  "  Блок.ЗНмин1   ",                   \
  "  Пуск ЗНмин1   ",                   \
  "  Блок.ЗНмин2   ",                   \
  "  Пуск ЗНмин2   ",                   \
  "  Блок.ЗНмакс1  ",                   \
  "  Блок.ЗНмакс2  ",                   \
  "    Блок.УЗx    ",                   \
  " Вх.О-функции1  ",                   \
  " Вх.О-функции2  ",                   \
  " Вх.О-функции3  ",                   \
  " Вх.О-функции4  ",                   \
  " Вх.О-функции5  ",                   \
  " Вх.О-функции6  ",                   \
  " Вх.О-функции7  ",                   \
  " Вх.О-функции8  ",                   \
  " Вх.О-функции9  ",                   \
  " Вх.О-функции10 ",                   \
  " Вх.О-функции11 ",                   \
  " Вх.О-функции12 ",                   \
  " Вх.О-функции13 ",                   \
  " Вх.О-функции14 ",                   \
  " Вх.О-функции15 ",                   \
  " Вх.О-функции16 ",                   \
  " Уст.О-триггера1",                   \
  " Сбр.О-триггера1",                   \
  " Уст.О-триггера2",                   \
  " Сбр.О-триггера2",                   \
  " Уст.О-триггера3",                   \
  " Сбр.О-триггера3",                   \
  " Уст.О-триггера4",                   \
  " Сбр.О-триггера4",                   \
  "      ФС1       ",                   \
  "      ФС2       ",                   \
  "      ФС3       ",                   \
  "      ФС4       ",                   \
  "      ФС5       ",                   \
  "      ФС6       ",                   \
  "      ФС7       ",                   \
  "      ФС8       ",                   \
  "      ФС9       ",                   \
  "      ФС10      ",                   \
  "      ФС11      ",                   \
  "      ФС12      ",                   \
  "      ФС13      ",                   \
  "      ФС14      ",                   \
  "      ФС15      ",                   \
  "      ФС16      "

#define NAME_RANG_SMALL_UA         \
  " Блок.увімкн.ВВ ",                   \
  " Скид.індикації ",                   \
  "   Скид.реле    ",                   \
  " Місц./Дистанц. ",                   \
  "    Стан ВВ     ",                   \
  "Вимк.від зовн.з.",                   \
  "    Увімк.ВВ    ",                   \
  " Контроль Увімк.",                   \
  "    Вимк.ВВ     ",                   \
  " Контроль Вимк. ",                   \
  " 1-а гр.уставок ",                   \
  " 2-а гр.уставок ",                   \
  " 3-а гр.уставок ",                   \
  " 4-а гр.уставок ",                   \
  " С.блк.Гот.до ТУ",                   \
  "    Блок.ДЗ1    ",                   \
  "    Блок.ДЗ2    ",                   \
  "  Блок.пр.ДЗ2   ",                   \
  "   Оп.пр.ДЗ2    ",                   \
  "    Блок.ДЗ3    ",                   \
  "  Блок.пр.ДЗ3   ",                   \
  "   Оп.пр.ДЗ3    ",                   \
  "    Блок.ДЗ4    ",                   \
  "  Блок.пр.ДЗ4   ",                   \
  "   Оп.пр.ДЗ4    ",                   \
  "  Зовн.НКН ДЗ   ",                   \
  "   Блок.МСЗ1    ",                   \
  "   Блок.МСЗ2    ",                   \
  " Блок.приск.МСЗ2",                   \
  "   Блок.МСЗ3    ",                   \
  "   Блок.МСЗ4    ",                   \
  "    Блок.ЗДЗ    ",                   \
  " Пуск ЗДЗ від ДВ",                   \
  "    Блок.НЗЗ    ",                   \
  "   Блок.СЗНП1   ",                   \
  "   Блок.СЗНП2   ",                   \
  "   Блок.СЗНП3   ",                   \
  " Стат.блок.АПВ  ",                   \
  " АЧР/ЧАПВ від ДВ",                   \
  "   Блок.АЧР1    ",                   \
  "   Блок.АЧР2    ",                   \
  "Пуск ПРВВ від ДВ",                   \
  " Блок.ЗЗП(КОФ)  ",                   \
  "  Блок.ЗНмин1   ",                   \
  "  Пуск ЗНмин1   ",                   \
  "  Блок.ЗНмин2   ",                   \
  "  Пуск ЗНмин2   ",                   \
  "  Блок.ЗНмакс1  ",                   \
  "  Блок.ЗНмакс2  ",                   \
  "    Блок.УЗx    ",                   \
  " Вх.В-функції1  ",                   \
  " Вх.В-функції2  ",                   \
  " Вх.В-функції3  ",                   \
  " Вх.В-функції4  ",                   \
  " Вх.В-функції5  ",                   \
  " Вх.В-функції6  ",                   \
  " Вх.В-функції7  ",                   \
  " Вх.В-функції8  ",                   \
  " Вх.В-функції9  ",                   \
  " Вх.В-функції10 ",                   \
  " Вх.В-функції11 ",                   \
  " Вх.В-функції12 ",                   \
  " Вх.В-функції13 ",                   \
  " Вх.В-функції14 ",                   \
  " Вх.В-функції15 ",                   \
  " Вх.В-функції16 ",                   \
  " Вст.В-триґера1 ",                   \
  " Ск.В-триґера1  ",                   \
  " Вст.В-триґера2 ",                   \
  " Ск.В-триґера2  ",                   \
  " Вст.В-триґера3 ",                   \
  " Ск.В-триґера3  ",                   \
  " Вст.В-триґера4 ",                   \
  " Ск.В-триґера4  ",                   \
  "      ФЗ1       ",                   \
  "      ФЗ2       ",                   \
  "      ФЗ3       ",                   \
  "      ФЗ4       ",                   \
  "      ФЗ5       ",                   \
  "      ФЗ6       ",                   \
  "      ФЗ7       ",                   \
  "      ФЗ8       ",                   \
  "      ФЗ9       ",                   \
  "      ФЗ10      ",                   \
  "      ФЗ11      ",                   \
  "      ФЗ12      ",                   \
  "      ФЗ13      ",                   \
  "      ФЗ14      ",                   \
  "      ФЗ15      ",                   \
  "      ФЗ16      "

#define NAME_RANG_SMALL_EN         \
  " ON CB Blocking ",                   \
  "Indication Reset",                   \
  "  Relay Reset   ",                   \
  "  Local/Remote  ",                   \
  "  State of CB   ",                   \
  "Откл.от вн.защит",                   \
  "     On CB      ",                   \
  " On CB Control  ",                   \
  "     Off CB     ",                   \
  " Off CB Control ",                   \
  " Pick-up Set 1  ",                   \
  " Pick-up Set 2  ",                   \
  " Pick-up Set 3  ",                   \
  " Pick-up Set 4  ",                   \
  " С.блк.Гот.к ТУ ",                   \
  "   Blc.of ДЗ1   ",                   \
  "   Blc.of ДЗ2   ",                   \
  "  ДЗ2 Acc.Blc.  ",                   \
  "   Оп.уск.ДЗ2   ",                   \
  "   Blc.of ДЗ3   ",                   \
  "  ДЗ3 Acc.Blc.  ",                   \
  "   Оп.уск.ДЗ3   ",                   \
  "   Blc.of ДЗ4   ",                   \
  "  ДЗ4 Acc.Blc.  ",                   \
  "   Оп.уск.ДЗ4   ",                   \
  "   Вн.НЦН ДЗ    ",                   \
  "  Blc.of OCP1   ",                   \
  "  Blc.of OCP2   ",                   \
  "  OCP2 Acc.Blc. ",                   \
  "  Blc.of OCP3   ",                   \
  "  Blc.of OCP4   ",                   \
  "    Блок.ЗДЗ    ",                   \
  " Пуск ЗДЗ от ДВ ",                   \
  "    Блок.НЗЗ    ",                   \
  "   Блок.ТЗНП1   ",                   \
  "   Блок.ТЗНП2   ",                   \
  "   Блок.ТЗНП3   ",                   \
  " Стат.блок.АПВ  ",                   \
  " АЧР/ЧАПВ от ДВ ",                   \
  "   Блок.АЧР1    ",                   \
  "   Блок.АЧР2    ",                   \
  " CBFP Start f.DI",                   \
  "  Blc.of NPSP   ",                   \
  "   Блок.Umin1   ",                   \
  "   Пуск Umin1   ",                   \
  "   Блок.Umin2   ",                   \
  "   Пуск Umin2   ",                   \
  "   Блок.Umax1   ",                   \
  "   Блок.Umax2   ",                   \
  "   Blc.of UPx   ",                   \
  "    UDF1 In     ",                   \
  "    UDF2 In     ",                   \
  "    UDF3 In     ",                   \
  "    UDF4 In     ",                   \
  "    UDF5 In     ",                   \
  "    UDF6 In     ",                   \
  "    UDF7 In     ",                   \
  "    UDF8 In     ",                   \
  "    UDF9 In     ",                   \
  "    UDF10 In    ",                   \
  "    UDF11 In    ",                   \
  "    UDF12 In    ",                   \
  "    UDF13 In    ",                   \
  "    UDF14 In    ",                   \
  "    UDF15 In    ",                   \
  "    UDF16 In    ",                   \
  "UD Flip-Flop1 S.",                   \
  "UD Flip-Flop1 R.",                   \
  "UD Flip-Flop2 S.",                   \
  "UD Flip-Flop2 R.",                   \
  "UD Flip-Flop3 S.",                   \
  "UD Flip-Flop3 R.",                   \
  "UD Flip-Flop4 S.",                   \
  "UD Flip-Flop4 R.",                   \
  "      СF1       ",                   \
  "      СF2       ",                   \
  "      СF3       ",                   \
  "      СF4       ",                   \
  "      СF5       ",                   \
  "      СF6       ",                   \
  "      СF7       ",                   \
  "      СF8       ",                   \
  "      СF9       ",                   \
  "      СF10      ",                   \
  "      СF11      ",                   \
  "      СF12      ",                   \
  "      СF13      ",                   \
  "      СF14      ",                   \
  "      СF15      ",                   \
  "      СF16      "
        
#define NAME_RANG_SMALL_KZ         \
  "  Блок.вкл.ВВ   ",                   \
  " Сброс индикации",                   \
  "   Сброс реле   ",                   \
  " Местн./Дистанц.",                   \
  "  Положение ВВ  ",                   \
  "Откл.от вн.защит",                   \
  "     Вкл.ВВ     ",                   \
  " Контроль Вкл.  ",                   \
  "    Откл.ВВ     ",                   \
  " Контроль Откл. ",                   \
  " 1-я гр.уставок ",                   \
  " 2-я гр.уставок ",                   \
  " 3-я гр.уставок ",                   \
  " 4-я гр.уставок ",                   \
  " С.блк.Гот.к ТУ ",                   \
  "    Блок.ДЗ1    ",                   \
  "    Блок.ДЗ2    ",                   \
  "  Блок.уск.ДЗ2  ",                   \
  "   Оп.уск.ДЗ2   ",                   \
  "    Блок.ДЗ3    ",                   \
  "  Блок.уск.ДЗ3  ",                   \
  "   Оп.уск.ДЗ3   ",                   \
  "    Блок.ДЗ4    ",                   \
  "  Блок.уск.ДЗ4  ",                   \
  "   Оп.уск.ДЗ4   ",                   \
  "   Вн.НЦН ДЗ    ",                   \
  "   Блок.МТЗ1    ",                   \
  "   Блок.МТЗ2    ",                   \
  " Блок.уск.МТЗ2  ",                   \
  "   Блок.МТЗ3    ",                   \
  "   Блок.МТЗ4    ",                   \
  "    Блок.ЗДЗ    ",                   \
  " Пуск ЗДЗ от ДВ ",                   \
  "    Блок.НЗЗ    ",                   \
  "   Блок.ТЗНП1   ",                   \
  "   Блок.ТЗНП2   ",                   \
  "   Блок.ТЗНП3   ",                   \
  " Стат.блок.АПВ  ",                   \
  " АЧР/ЧАПВ от ДВ ",                   \
  "   Блок.АЧР1    ",                   \
  "   Блок.АЧР2    ",                   \
  " Пуск УРОВ от ДВ",                   \
  " Блок.ЗОП(КОФ)  ",                   \
  "  Блок.ЗНмин1   ",                   \
  "  Пуск ЗНмин1   ",                   \
  "  Блок.ЗНмин2   ",                   \
  "  Пуск ЗНмин2   ",                   \
  "  Блок.ЗНмакс1  ",                   \
  "  Блок.ЗНмакс2  ",                   \
  "    Блок.УЗx    ",                   \
  " Вх.О-функции1  ",                   \
  " Вх.О-функции2  ",                   \
  " Вх.О-функции3  ",                   \
  " Вх.О-функции4  ",                   \
  " Вх.О-функции5  ",                   \
  " Вх.О-функции6  ",                   \
  " Вх.О-функции7  ",                   \
  " Вх.О-функции8  ",                   \
  " Вх.О-функции9  ",                   \
  " Вх.О-функции10 ",                   \
  " Вх.О-функции11 ",                   \
  " Вх.О-функции12 ",                   \
  " Вх.О-функции13 ",                   \
  " Вх.О-функции14 ",                   \
  " Вх.О-функции15 ",                   \
  " Вх.О-функции16 ",                   \
  " Уст.О-триггера1",                   \
  " Сбр.О-триггера1",                   \
  " Уст.О-триггера2",                   \
  " Сбр.О-триггера2",                   \
  " Уст.О-триггера3",                   \
  " Сбр.О-триггера3",                   \
  " Уст.О-триггера4",                   \
  " Сбр.О-триггера4",                   \
  "      ФС1       ",                   \
  "      ФС2       ",                   \
  "      ФС3       ",                   \
  "      ФС4       ",                   \
  "      ФС5       ",                   \
  "      ФС6       ",                   \
  "      ФС7       ",                   \
  "      ФС8       ",                   \
  "      ФС9       ",                   \
  "      ФС10      ",                   \
  "      ФС11      ",                   \
  "      ФС12      ",                   \
  "      ФС13      ",                   \
  "      ФС14      ",                   \
  "      ФС15      ",                   \
  "      ФС16      "









//  "kСбр.О-триггера4"

#ifndef NAME_RANG_SMALL_A01_RU_      
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//!~~~@     RU BEGIN  NAMES             ~~~~
//!~~~@     RU BEGIN  NAMES             ~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````

#define NAME_RANG_SMALL_A01_RU \
  "  Блок.вкл.ВВО  ", \
  "  Блок.вкл.ВВР  ", \
  " Сброс индикации", \
  "   Сброс реле   ", \
  " Местн./Дистанц.", \
  "  Положение ВВР ", \
  "  Положение ВВО ", \
  "     Вкл.ВВО    ", \
  "     Вкл.ВВР    ", \
  "Контроль Вкл.ВВО", \
  "Контроль Вкл.ВВР", \
  "    Откл.ВВО    ", \
  "    Откл.ВВР    ", \
  "Контроль Откл.ВО", \
  "Контроль Откл.ВР", \
  " 1-я гр.уставок ", \
  " 2-я гр.уставок ", \
  " 3-я гр.уставок ", \
  " 4-я гр.уставок ", \
  " С.блк.Гот.к ТУ ", \
  "   Вн.НЦН ДЗО   ", \
  "Запр.Блк.ДЗО1 I3", \
  "Запр.Блк.ДЗО1 IО", \
  "    Блок.ДЗО1   ", \
  "  Блок.уск.ДЗО2 ", \
  "   Оп.уск.ДЗО2  ", \
  "Запр.Блк.ДЗО2 I3", \
  "    Блок.ДЗ2    ", \
  "  Блок.уск.ДЗО3 ", \
  "   Оп.уск.ДЗО3  ", \
  "Запр.Блк.ДЗО3 I3", \
  "    Блок.ДЗО3   ", \
  "Запр.Блк.ДЗО4 I3", \
  "    Блок.ДЗО4   ", \
  "    Блок.ЗДЗ    ", \
  " Пуск ЗДЗ от ДВ ", \
  "   Блок.МТЗО1   ", \
  "   Блок.МТЗО2   ", \
  " Блок.уск.МТЗО2 ", \
  "   Блок.МТЗО3   ", \
  "   Блок.МТЗО4   ", \
  "   Блок.МТЗР1   ", \
  "   Блок.МТЗР2   ", \
  " Стат.блок.АПВ  ", \
  " АЧР/ЧАПВ от ДВ ", \
  "   Блок.АЧР1    ", \
  "   Блок.АЧР2    ", \
  " Пуск УРОВ от ДВ", \
  "   Вн.НЦН ДЗР   ", \
  "Запр.Блк.ДЗР1 I3", \
  "Запр.Блк.ДЗР1 IР", \
  "    Блок.ДЗР1   ", \
  "  Блок.уск.ДЗР2 ", \
  "   Оп.уск.ДЗР2  ", \
  "Запр.Блк.ДЗР2 I3", \
  "    Блок.ДЗ2    ", \
  "  Блок.уск.ДЗР3 ", \
  "   Оп.уск.ДЗР3  ", \
  "Запр.Блк.ДЗР3 I3", \
  "    Блок.ДЗР3   ", \
  "  Блок.ЗНмин1   ", \
  "  Пуск ЗНмин1   ", \
  "  Блок.ЗНмин2   ", \
  "  Пуск ЗНмин2   ", \
  "  Блок.ЗНмакс1  ", \
  "  Блок.ЗНмакс2  ", \
  "    Блок.УЗx    ", \
  " Вх.О-функции1  ", \
  " Сб.О-функции1  ", \
  " Вх.О-функции2  ", \
  " Сб.О-функции2  ", \
  " Вх.О-функции3  ", \
  " Сб.О-функции3  ", \
  " Вх.О-функции4  ", \
  " Сб.О-функции4  ", \
  " Вх.О-функции5  ", \
  " Сб.О-функции5  ", \
  " Вх.О-функции6  ", \
  " Сб.О-функции6  ", \
  " Вх.О-функции7  ", \
  " Сб.О-функции7  ", \
  " Вх.О-функции8  ", \
  " Сб.О-функции8  ", \
  " Вх.О-функции9  ", \
  " Сб.О-функции9  ", \
  " Вх.О-функции10 ", \
  " Сб.О-функции10 ", \
  " Вх.О-функции11 ", \
  " Сб.О-функции11 ", \
  " Вх.О-функции12 ", \
  " Сб.О-функции12 ", \
  " Вх.О-функции13 ", \
  " Сб.О-функции13 ", \
  " Вх.О-функции14 ", \
  " Сб.О-функции14 ", \
  " Вх.О-функции15 ", \
  " Сб.О-функции15 ", \
  " Вх.О-функции16 ", \
  " Сб.О-функции16 ", \
  " Уст.О-триггера1", \
  " Сбр.О-триггера1", \
  " Уст.О-триггера2", \
  " Сбр.О-триггера2", \
  " Уст.О-триггера3", \
  " Сбр.О-триггера3", \
  " Уст.О-триггера4", \
  " Сбр.О-триггера4", \
  "      ФС1       ", \
  "      ФС2       ", \
  "      ФС3       ", \
  "      ФС4       ", \
  "      ФС5       ", \
  "      ФС6       ", \
  "      ФС7       ", \
  "      ФС8       ", \
  "      ФС9       ", \
  "      ФС10      ", \
  "      ФС11      ", \
  "      ФС12      ", \
  "      ФС13      ", \
  "      ФС14      ", \
  "      ФС15      ", \
  "      ФС16      "  
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//!~~~$                                          RU END NAMES         ~~~~~
//!~~~$                                          RU END NAMES         ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

#endif  //NAME_RANG_SMALL_A01_RU_
 
#ifndef NAME_RANG_SMALL_A01_UA_ 
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//!~~~@     UA BEGIN  NAMES             ~~~~
//!~~~@     UA BEGIN  NAMES             ~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//`````````````````````````````````````````````````````````````````````````````````` 
#define NAME_RANG_SMALL_A01_UA    \
  "Блок.увімкн.ВВО ",   \
  "Блок.увімкн.ВВР ",   \
  " Скид.індикації ",   \
  "   Скид.реле    ",   \
  " Місц./Дистанц. ",   \
  "    Стан ВВО    ",   \
  "    Стан ВВР    ",   \
  "    Увімк.ВВО   ",   \
  "    Увімк.ВВР   ",   \
  "Контр. Увімк.ВО ",   \
  "Контр. Увімк.ВР ",   \
  "    Вимк.ВО     ",   \
  "    Вимк.ВР     ",   \
  " Контр.Вимк.ВВО ",   \
  " Контр.Вимк.ВВР ",   \
  " 1-а гр.уставок ",   \
  " 2-а гр.уставок ",   \
  " 3-а гр.уставок ",   \
  " 4-а гр.уставок ",   \
  " С.блк.Гот.до ТУ",   \
  "  Зовн.НКН ДЗО  ",   \
  "Збр.Блк.ДЗО1 I3 ",   \
  "Збр.Блк.ДЗО1 IО ",   \
  "    Блок.ДЗО1   ",   \
  "  Блок.пр.ДЗО2  ",   \
  "   Оп.пр.ДЗО2   ",   \
  " Збр.Блк.ДЗО2 I3",   \
  "    Блок.ДЗО2   ",   \
  "  Блок.пр.ДЗО3  ",   \
  "   Оп.пр.ДЗ3    ",   \
  " Збр.Блк.ДЗО3 I3",   \
  "    Блок.ДЗО3   ",   \
  " Збр.Блк.ДЗО4 I3",   \
  "    Блок.ДЗО4   ",   \
  "    Блок.ЗДЗ    ",   \
  " Пуск ЗДЗ від ДВ",   \
  "   Блок.МСЗО1   ",   \
  "   Блок.МСЗО2   ",   \
  " Блок.пр.МСЗО2  ",   \
  "   Блок.МСЗО3   ",   \
  "   Блок.МСЗО4   ",   \
  "   Блок.МСЗР1   ",   \
  "   Блок.МСЗР2   ",   \
  " Стат.блок.АПВ  ",   \
  " АЧР/ЧАПВ від ДВ",   \
  "   Блок.АЧР1    ",   \
  "   Блок.АЧР2    ",   \
  "Пуск ПРВВ від ДВ",   \
  "  Зовн.НКН ДЗР  ",   \
  " Збр.Блк.ДЗР1 I3",   \
  " Збр.Блк.ДЗР1 Iр",   \
  "    Блок.ДЗР1   ",   \
  "  Блок.пр.ДЗР2  ",   \
  "   Оп.пр.ДЗР2   ",   \
  " Збр.Блк.ДЗР2 I3",   \
  "    Блок.ДЗР2   ",   \
  "  Блок.пр.ДЗР3  ",   \
  "   Оп.пр.ДЗР3   ",   \
  " Збр.Блк.ДЗР3 I3",   \
  "    Блок.ДЗР3   ",   \
  "  Блок.ЗНмін1   ",   \
  "  Пуск ЗНмін1   ",   \
  "  Блок.ЗНмін2   ",   \
  "  Пуск ЗНмін2   ",   \
  "  Блок.ЗНмакс1  ",   \
  "  Блок.ЗНмакс2  ",   \
  "    Блок.УЗx    ",   \
  " Вх.В-функції1  ",   \
  " Ск.В-функції1  ",   \
  " Вх.В-функції2  ",   \
  " Ск.В-функції2  ",   \
  " Вх.В-функції3  ",   \
  " Ск.В-функції3  ",   \
  " Вх.В-функції4  ",   \
  " Ск.В-функції4  ",   \
  " Вх.В-функції5  ",   \
  " Ск.В-функції5  ",   \
  " Вх.В-функції6  ",   \
  " Ск.В-функції6  ",   \
  " Вх.В-функції7  ",   \
  " Ск.В-функції7  ",   \
  " Вх.В-функції8  ",   \
  " Ск.В-функції8  ",   \
  " Вх.В-функції9  ",   \
  " Ск.В-функції9  ",   \
  " Вх.В-функції10 ",   \
  " Ск.В-функції10 ",   \
  " Вх.В-функції11 ",   \
  " Ск.В-функції11 ",   \
  " Вх.В-функції12 ",   \
  " Ск.В-функції12 ",   \
  " Вх.В-функції13 ",   \
  " Ск.В-функції13 ",   \
  " Вх.В-функції14 ",   \
  " Ск.В-функції14 ",   \
  " Вх.В-функції15 ",   \
  " Ск.В-функції15 ",   \
  " Вх.В-функції16 ",   \
  " Ск.В-функції16 ",   \
  " Вст.В-триґера1 ",   \
  " Ск.В-триґера1  ",   \
  " Вст.В-триґера2 ",   \
  " Ск.В-триґера2  ",   \
  " Вст.В-триґера3 ",   \
  " Ск.В-триґера3  ",   \
  " Вст.В-триґера4 ",   \
  " Ск.В-триґера4  ",    \
  "      ФЗ1       ",   \
  "      ФЗ2       ",   \
  "      ФЗ3       ",   \
  "      ФЗ4       ",   \
  "      ФЗ5       ",   \
  "      ФЗ6       ",   \
  "      ФЗ7       ",   \
  "      ФЗ8       ",   \
  "      ФЗ9       ",   \
  "      ФЗ10      ",   \
  "      ФЗ11      ",   \
  "      ФЗ12      ",   \
  "      ФЗ13      ",   \
  "      ФЗ14      ",   \
  "      ФЗ15      ",   \
  "      ФЗ16      "
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//!~~~$                                          UA END NAMES         ~~~~~
//!~~~$                                          UA END NAMES         ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
  
#endif  //NAME_RANG_SMALL_A01_UA_

#ifndef NAME_RANG_SMALL_A01_EN_ 
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//!~~~@    EN BEGIN  NAMES             ~~~~
//!~~~@    EN BEGIN  NAMES             ~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//`````````````````````````````````````````````````````````````````````````````````` 	
  #define NAME_RANG_SMALL_A01_EN \
  " ON CBM Blocking", \
  " ON CBR Blocking", \
  "Indication Reset", \
  "  Relay Reset   ", \
  "  Local/Remote  ", \
  "  State of CBM  ", \
  "  State of CBR  ", \
  "     On CBM     ", \
  "     On CBR     ", \
  " On CBM Control ", \
  " On CBR Control ", \
  "     Off CBM    ", \
  "     Off CBR    ", \
  " Off CBM Control", \
  " Off CBR Control", \
  " Pick-up Set 1  ", \
  " Pick-up Set 2  ", \
  " Pick-up Set 3  ", \
  " Pick-up Set 4  ", \
  "Rem Ctr R Bl Res", \
  "   Вн.НЦН ДЗО EN", \
  "Eапр.Блк.ДЗО1 I3", \
  "Eапр.Блк.ДЗО1 IО", \
  "E   Блок.ДЗО1   ", \
  "E Блок.уск.ДЗО2 ", \
  "E  Оп.уск.ДЗО2  ", \
  "Eапр.Блк.ДЗО2 I3", \
  "E   Блок.ДЗ2    ", \
  "E Блок.уск.ДЗО3 ", \
  "E  Оп.уск.ДЗО3  ", \
  "Eапр.Блк.ДЗО3 I3", \
  "E   Блок.ДЗО3   ", \
  "Eапр.Блк.ДЗО4 I3", \
  "E   Блок.ДЗО4   ", \
  " AFD Op         ", \
  " SDEFP Block    ", \
  "   OCPM1 Block  ", \
  "   OCPM2 Block  ", \
  " OCP2 Acc Block ", \
  "   OCPM3 Block  ", \
  "   OCPM4 Block  ", \
  "   OCPR1 Block  ", \
  "   OCPR2 Block  ", \
  "Static Blc.of AR", \
  "UFLS/FAR from DI", \
  "   LFС1 Block   ", \
  "   LFС2 Block   ", \
  "   CBF vBI Start", \
  "E  Вн.НЦН ДЗР   ", \
  "Eапр.Блк.ДЗР1 I3", \
  "Eапр.Блк.ДЗР1 IР", \
  "E   Блок.ДЗР1   ", \
  "E Блок.уск.ДЗР2 ", \
  "E  Оп.уск.ДЗР2  ", \
  "Eапр.Блк.ДЗР2 I3", \
  "E   Блок.ДЗ2    ", \
  "E Блок.уск.ДЗР3 ", \
  "E  Оп.уск.ДЗР3  ", \
  "Eапр.Блк.ДЗР3 I3", \
  "E   Блок.ДЗР3   ", \
  "   UVP1 Block   ", \
  "  UVP1 vBI Start", \
  "   UVP2 Block   ", \
  "  UVP2 vBI Start", \
  "   OVP1 Block   ", \
  "  OVP2 Block    ", \
  "   MFPx Block   ", \
  "    UDF1 In     ", \
  "  UDF1 Rst In   ", \
  "    UDF2 In     ", \
  "  UDF2 Rst In   ", \
  "    UDF3 In     ", \
  "  UDF3 Rst In   ", \
  "    UDF4 In     ", \
  "  UDF4 Rst In   ", \
  "    UDF5 In     ", \
  "  UDF5 Rst In   ", \
  "    UDF6 In     ", \
  "  UDF6 Rst In   ", \
  "    UDF7 In     ", \
  "  UDF7 Rst In   ", \
  "    UDF8 In     ", \
  "  UDF8 Rst In   ", \
  "    UDF9 In     ", \
  "  UDF9 Rst In   ", \
  "    UDF10 In    ", \
  "  UDF10 Rst In  ", \
  "    UDF11 In    ", \
  "  UDF11 Rst In  ", \
  "    UDF12 In    ", \
  "  UDF12 Rst In  ", \
  "    UDF13 In    ", \
  "  UDF13 Rst In  ", \
  "    UDF14 In    ", \
  "  UDF14 Rst In  ", \
  "    UDF15 In    ", \
  "  UDF15 Rst In  ", \
  "    UDF16 In    ", \
  "  UDF16 Rst In  ", \
  "UD Flip-Flop1 S.", \
  "UD Flip-Flop1 R.", \
  "UD Flip-Flop2 S.", \
  "UD Flip-Flop2 R.", \
  "UD Flip-Flop3 S.", \
  "UD Flip-Flop3 R.", \
  "UD Flip-Flop4 S.", \
  "UD Flip-Flop4 R.", \
  "      СF1       ", \
  "      СF2       ", \
  "      СF3       ", \
  "      СF4       ", \
  "      СF5       ", \
  "      СF6       ", \
  "      СF7       ", \
  "      СF8       ", \
  "      СF9       ", \
  "      СF10      ", \
  "      СF11      ", \
  "      СF12      ", \
  "      СF13      ", \
  "      СF14      ", \
  "      СF15      ", \
  "      СF16      "

//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//!~~~$                                          EN END NAMES         ~~~~~
//!~~~$                                          EN END NAMES         ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
#endif //NAME_RANG_SMALL_A01_EN_

 
#ifndef NAME_RANG_SMALL_A01_KZ_ 
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//!~~~@    KZ BEGIN  NAMES             ~~~~
//!~~~@    KZ BEGIN  NAMES             ~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
#define NAME_RANG_SMALL_A01_KZ \
  "kzБлок.вкл.ВВО  ", \
  "kzБлок.вкл.ВВР  ", \
  "kzброс индикации", \
  "kz Сброс реле   ", \
  "kzестн./Дистанц.", \
  "kzПоложение ВВР ", \
  "kzПоложение ВВО ", \
  "kz   Вкл.ВВО    ", \
  "kz   Вкл.ВВР    ", \
  "kzнтроль Вкл.ВВО", \
  "kzнтроль Вкл.ВВР", \
  "kz  Откл.ВВО    ", \
  "kz  Откл.ВВР    ", \
  "kzнтроль Откл.ВО", \
  "kzнтроль Откл.ВР", \
  "kz-я гр.уставок ", \
  "kz-я гр.уставок ", \
  "kz-я гр.уставок ", \
  "kz-я гр.уставок ", \
  "kz.блк.Гот.к ТУ ", \
  "kz Вн.НЦН ДЗО   ", \
  "kzпр.Блк.ДЗО1 I3", \
  "kzпр.Блк.ДЗО1 IО", \
  "kz  Блок.ДЗО1   ", \
  "kzБлок.уск.ДЗО2 ", \
  "kz Оп.уск.ДЗО2  ", \
  "kzпр.Блк.ДЗО2 I3", \
  "kz  Блок.ДЗ2    ", \
  "kzБлок.уск.ДЗО3 ", \
  "kz Оп.уск.ДЗО3  ", \
  "kzпр.Блк.ДЗО3 I3", \
  "kz  Блок.ДЗО3   ", \
  "kzпр.Блк.ДЗО4 I3", \
  "kz  Блок.ДЗО4   ", \
  "kz  Блок.ЗДЗ    ", \
  "kzуск ЗДЗ от ДВ ", \
  "kz Блок.МТЗО1   ", \
  "kz Блок.МТЗО2   ", \
  "kzлок.уск.МТЗО2 ", \
  "kz Блок.МТЗО3   ", \
  "kz Блок.МТЗО4   ", \
  "kz Блок.МТЗР1   ", \
  "kz Блок.МТЗР2   ", \
  "kzтат.блок.АПВ  ", \
  "kzЧР/ЧАПВ от ДВ ", \
  "kz Блок.АЧР1    ", \
  "kz Блок.АЧР2    ", \
  "kzуск УРОВ от ДВ", \
  "kz Вн.НЦН ДЗР   ", \
  "kzпр.Блк.ДЗР1 I3", \
  "kzпр.Блк.ДЗР1 IР", \
  "kz  Блок.ДЗР1   ", \
  "kzБлок.уск.ДЗР2 ", \
  "kz Оп.уск.ДЗР2  ", \
  "kzпр.Блк.ДЗР2 I3", \
  "kz  Блок.ДЗ2    ", \
  "kzБлок.уск.ДЗР3 ", \
  "kz Оп.уск.ДЗР3  ", \
  "kzпр.Блк.ДЗР3 I3", \
  "kz  Блок.ДЗР3   ", \
  "kzБлок.ЗНмин1   ", \
  "kzПуск ЗНмин1   ", \
  "kzБлок.ЗНмин2   ", \
  "kzПуск ЗНмин2   ", \
  "kzБлок.ЗНмакс1  ", \
  "kzБлок.ЗНмакс2  ", \
  "kz  Блок.УЗx    ", \
  "kz    О-ф1  вх  ", \
  "kz  О-ф1  Сброс ", \
  "kz    О-ф2  вх  ", \
  "kz  О-ф2  Сброс ", \
  "kz    О-ф3  вх  ", \
  "kz  О-ф3  Сброс ", \
  "kz    О-ф4  вх  ", \
  "kz  О-ф4  Сброс ", \
  "kz    О-ф5  вх  ", \
  "kz  О-ф5  Сброс ", \
  "kz    О-ф6  вх  ", \
  "kz  О-ф6  Сброс ", \
  "kz    О-ф7  вх  ", \
  "kz  О-ф7  Сброс ", \
  "kz    О-ф8  вх  ", \
  "kz  О-ф8  Сброс ", \
  "kz    О-ф9  вх  ", \
  "kz  О-ф9  Сброс ", \
  "kz    О-ф10 вх  ", \
  "kz  О-ф10 Сброс ", \
  "kz    О-ф11 вх  ", \
  "kz  О-ф11 Сброс ", \
  "kz    О-ф12 вх  ", \
  "kz  О-ф12 Сброс ", \
  "kz    О-ф13 вх  ", \
  "kz  О-ф13 Сброс ", \
  "kz    О-ф14 вх  ", \
  "kz  О-ф14 Сброс ", \
  "kz    О-ф15 вх  ", \
  "kz  О-ф15 Сброс ", \
  "kz    О-ф16 вх  ", \
  "kz  О-ф16 Сброс ", \
  "kzст.О-триггера1", \
  "kzбр.О-триггера1", \
  "kzст.О-триггера2", \
  "kzбр.О-триггера2", \
  "kzст.О-триггера3", \
  "kzбр.О-триггера3", \
  "kzст.О-триггера4", \
  "kzбр.О-триггера4", \
  "      ФС1       ", \
  "      ФС2       ", \
  "      ФС3       ", \
  "      ФС4       ", \
  "      ФС5       ", \
  "      ФС6       ", \
  "      ФС7       ", \
  "      ФС8       ", \
  "      ФС9       ", \
  "      ФС10      ", \
  "      ФС11      ", \
  "      ФС12      ", \
  "      ФС13      ", \
  "      ФС14      ", \
  "      ФС15      ", \
  "      ФС16      "
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//!~~~$                                          KZ END NAMES         ~~~~~
//!~~~$                                          KZ END NAMES         ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
#endif //NAME_RANG_SMALL_A01_KZ_ 









#endif 
